[{
  "markdown": "Nano Banana Pro Prompts - High-Quality AI Prompts & Image Generation - YouMind\n\n[](https://youmind.com/)\n\n[](https://github.com/YouMind-OpenLab/awesome-nano-banana-pro-prompts \"GitHub\")\n\nEnglish\n\n# Nano Banana Pro  \nPrompts\n\nAuto\n\nRandom\n\nGenerate\n\n## Fresh Prompts\n\n[](https://youmind.com/)\n\n[](https://github.com/YouMind-OpenLab/awesome-nano-banana-pro-prompts/issues/new?template=submit-prompt.yml \"Submit Prompt\")\n\nTOTAL(UPDATING): 2193\n\nAllProfile / AvatarSocial Media PostInfographic / Edu VisualYouTube ThumbnailComic / StoryboardPoster / FlyerApp / Web Design\n\nFilter\n\nPromptOriginal\n\nFeatured\n\nBY[@Nicolechan](https://x.com/stark_nico99 \"@Nicolechan\")\n\nNov 20, 2025\n\n[\n\n### Wide quote card with portrait and Chinese/English customization\n\n](https://x.com/stark_nico99/status/1991718646570426763)\n\n![Wide quote card with portrait and Chinese/English customization - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886933714_5zqn1e_G6QBjQHbgAE3Yt_-300x168.jpg)\n\n![Wide quote card with portrait and Chinese/English customization - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886938314_wbcfc7_G6QBiiracAInQ8z-300x168.jpg)\n\n![Wide quote card with portrait and Chinese/English customization - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886941069_1d9ace_G6QBii_acAIRxKd-300x127.jpg)\n\n![Wide quote card with portrait and Chinese/English customization - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886946388_nwahev_G6QBikOaEAAmYkO-300x166.jpg)\n\nA prompt for generating a wide quote card featuring a famous person’s portrait, with a brown background, light-gold serif quote text, and layout where text occupies two-thirds and the person one-third. The quote text and author are parameterized for reuse.\n\nPromptOriginal\n\nA wide quote card featuring a famous person, with a brown background and a light-gold serif font for the quote: “Stay Hungry, Stay Foolish” and smaller text: “—Steve Jobs.” There is a large, subtle quotation mark before the text. The portrait of the person is on the left, the text on the right. The text occupies two-thirds of the image and the portrait one-third, with a slight gradient transition effect on the portrait.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@セミナー講師専門AIコンシェルジュ｜工藤 晶](https://x.com/akirakudo_ai \"@セミナー講師専門AIコンシェルジュ｜工藤 晶\")\n\nNov 22, 2025\n\n[\n\n### Hand-drawn style header image prompt from photo\n\n](https://x.com/akirakudo_ai/status/1992096860765561190)\n\n![Hand-drawn style header image prompt from photo - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885651870_4szbai_G6VZiROagAAqsIh-300x168.jpg)\n\n![Hand-drawn style header image prompt from photo - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885654537_qf6h9o_G6VZiRWaIAA_9x5-300x380.jpg)\n\nPrompt for a hand-drawn style header image of a person introducing Nano Banana Pro\n\nPromptOriginal\n\nCompletely recreate the uploaded person. Make it a header image for a note article where that person introduces “Nano Banana Pro”. Aspect ratio: horizontal 16:9. Style and colors: simple, hand-drawn style, italic, with a blue and green gradient. Title text: “In-depth explanation of Google’s new AI ‘Nano Banana Pro’”.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@Florian Gallwitz](https://x.com/FlorianGallwitz \"@Florian Gallwitz\")\n\nNov 21, 2025\n\n[\n\n### Watercolor map of Germany with labeled states\n\n](https://x.com/FlorianGallwitz/status/1991796624646091091)\n\n![Watercolor map of Germany with labeled states](https://cms-assets.youmind.com/media/1763886061720_fzgqaq_G6RIeSZXgAA7cOf-300x164.jpg)\n\nPREVIEW\n\nA German prompt to generate a watercolor-style map of Germany where all federal states are labeled in ballpoint pen, useful for educational or infographic-style maps.\n\nPromptOriginal\n\nGenerate a map of Germany in watercolor style, on which all federal states are labeled in ballpoint pen.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@ひでもん | AI開発@ニュース発信](https://x.com/okknews \"@ひでもん | AI開発@ニュース発信\")\n\nNov 22, 2025\n\n[\n\n### Chalkboard-style AI news summary\n\n](https://x.com/okknews/status/1992173611520868372)\n\n![Chalkboard-style AI news summary - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885620059_vzaj75_G6WfVvIbAAEgvYg-300x300.jpg)\n\n![Chalkboard-style AI news summary - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885622901_pk1vka_G6P2CkracAINIfP-300x300.jpg)\n\nA Japanese prompt for turning AI news content into a hand-drawn, teacher-style chalkboard diagram with explanations.\n\nPromptOriginal\n\nUsing the following content, summarize the news in a chalkboard-style, hand‑written look, and break it down with diagrams and easy‑to‑understand expressions as if a teacher had written it. —- Search results from Grok\n\nTry it now\n\n![Nano Banana Pro Hands-On: 10 Mind-Blowing Real-World Cases](https://cms-assets.youmind.com/media/1763948516286_6slrwd_Generated_Image_November_24_2025_-_9_41AM-900x604.jpg)\n\nBLOG\n\n### Nano Banana Pro Hands-On: 10 Mind-Blowing Real-World Cases\n\n[EXPLORE MORE CASES](https://youmind.com/blog/nano-banana-pro-10-real-cases)\n\nPromptOriginal\n\nFeatured\n\nBY[@KAWAI](https://x.com/kawai_design \"@KAWAI\")\n\nNov 22, 2025\n\n[\n\n### Train-ad style book advertisement image\n\n](https://x.com/kawai_design/status/1992142466255114727)\n\n![Train-ad style book advertisement image](https://cms-assets.youmind.com/media/1763885539326_yao7in_G6WBYReawAAcp2x-300x168.jpg)\n\nPREVIEW\n\nA detailed Japanese prompt for generating a 16:9 business-book-style advertisement featuring a specific book image with Japanese copy points.\n\nPromptOriginal\n\nPlease generate an advertisement image. ==== Ad specifications === - Aspect ratio: 16:9 (horizontal) - Product to advertise: the book in the first attached image - Main eye-catcher: place the book from the first attached image in a three-dimensional way - Language: Japanese - Taste: advertisement for a business book # Text to include: - Pre-head copy: 【New print run decided about one week after release】 Book “Designing from Zero with AI” now on sale and doing well. Amazon Best Seller Ranking Ranked No.1 in commercial design sales (as of 10/15) https://t.co/QxbYpfFVj6\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@VoxcatAI](https://x.com/VoxcatAI \"@VoxcatAI\")\n\nDec 3, 2025\n\n[\n\n### Luxury minimalist product photography based on a reference image\n\n](https://x.com/VoxcatAI/status/1996273073725780161)\n\n![Luxury minimalist product photography based on a reference image](https://cms-assets.youmind.com/media/1764915823213_skhwpb_G7Qvxi5bIAAqpfX-300x372.jpg)\n\nPREVIEW\n\nA prompt for generating high-end, minimalist commercial product photography in the style of luxury brand ads, using an uploaded reference image of the core product as the base.\n\nPromptOriginal\n\nUsing my uploaded reference image as the base, generate a minimalist, high-quality commercial still life photograph with the aesthetic of a luxury brand advertisement. Preserve the general shape, proportions, and main color scheme of the core product in the reference so that it is instantly recognizable as the same product, but upgrade the overall texture and atmosphere of the image, making it look like an ad for a top-tier international fragrance, skincare item, or high-end electronic product. Use a vertical 4:5 composition. The background should be a large area of clean, neutral negative space, such as soft off-white, cool gray, or light beige, creating a quiet, restrained, and expensive studio environment. Apart from the core product and a minimal number of necessary supports, do not add any extra decorations. No clutter, no elaborate scene setup—only keep very simple geometric supports (such as a plain white cube, a cylinder, or a thin transparent panel). The supports must be simple and low-profile, existing only to hold and accentuate the product. Strongly emphasize the material details of the product, and let the lighting fully serve those materials: Show frosted glass with a fine, soft matte texture, ceramics with a matte or slightly glazed feel, and polished metal with clean, sharp specular highlights. Liquids should have clearly visible viscosity and volume. Avoid any cheap plastic feel, complex patterns, or gaudy stickers; the overall material quality must feel cool, restrained, and luxurious. Use professional studio lighting: mainly soft, diffused light from softboxes, plus precise rim light outlining the product’s shape. The contours should be crisp and layered, and the shadows should be soft and clean, with no noise or dirty shadow patches. You may use a near-macro viewpoint, moving in closer to the product to highlight materials and details, while preserving ample negative space around the frame so the product can \"speak for itself\" in the emptiness. Keep the overall color scheme neutral and calm. The product’s own color can be slightly more saturated, making it the single visual focal point in the scene. Do not use exaggerated gradient backgrounds, flashy colored lighting, or e-commerce promo aesthetics. No large-price text, labels, or cartoon graphics. The final result must be a high-resolution commercial key visual that looks ready for a magazine back cover or a high-end brand announcement poster: minimalist, quiet, high-end, with the core product confidently centered, surrounded by clean negative space and precisely controlled lighting.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@Johnn](https://x.com/john_my07 \"@Johnn\")\n\nDec 3, 2025\n\n[\n\n### London outdoor restaurant portrait with Nano Banana Pro\n\n](https://x.com/john_my07/status/1996230085645623770)\n\n![London outdoor restaurant portrait with Nano Banana Pro - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909307226_bcwb2i_G7QIraQaoAANflM-300x300.jpg)\n\n![London outdoor restaurant portrait with Nano Banana Pro - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909309972_89pbp7_G7QIrrebwAAGCPK-300x300.jpg)\n\nA photorealistic prompt for a young woman at a calm London outdoor restaurant on a crisp March morning, with shallow depth of field and candid phone-photo vibes.\n\nPrompt\n\nCreate a photorealistic image of a young woman sitting at a relaxed outdoor restaurant in London on a cool Wednesday morning in March 2025. The sky is clear, the spring air is crisp, and the city feels calm as it wakes up. She is the focal point of the shot—wearing a light scarf, gently stirring her tea while gazing off to the side with a thoughtful expression. Everything behind her, from the waiter moving about to the soft morning traffic, should fall into a smooth blur, giving the picture the effortless, candid atmosphere of a moment casually snapped on a phone.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@松果先森](https://x.com/songguoxiansen \"@松果先森\")\n\nNov 21, 2025\n\n[\n\n### Dream diary with Kirby blowing bubbles\n\n](https://x.com/songguoxiansen/status/1991795708308189668)\n\n![Dream diary with Kirby blowing bubbles](https://cms-assets.youmind.com/media/1763886710060_ndpy3q_G6RHoGna4AArBDN-300x164.jpg)\n\nPREVIEW\n\nA cute prompt for a dreamy diary-style illustration of a pink Kirby sleeping on a star, blowing rainbow bubbles amid pastel clouds and candy.\n\nPromptOriginal\n\nDream diary. A pink Kirby lying asleep on a star, blowing rainbow-colored bubbles from its mouth. Soft macaron color palette, cloud and candy stickers, glittery crayon-like details, dreamy and sweet.\n\nTry it now\n\n[![WordsCard](https://cdn.gooo.ai/web-images/5e0199359a6eb05237a68c9cdc7e6d650f01bf6532a91f73e5fad5541088c17c@small)\n\nAI Shortcut\n\nInstall\n\n\n\n](https://youmind.com/shortcuts/dc2099fa-32d7-465a-a5d2-70388b11d8bd)\n\n[\n\n### WordsCard\n\nLike a professional designer, generate high-quality children's literacy flashcards with one click. Realistic patterns, soft backgrounds, standard phonetic notations—instantly elevating teaching efficiency.\n\n\n\n](https://youmind.com/shortcuts/dc2099fa-32d7-465a-a5d2-70388b11d8bd)[Install on YouMind](https://youmind.com/shortcuts/dc2099fa-32d7-465a-a5d2-70388b11d8bd)\n\nPromptOriginal\n\nFeatured\n\nBY[@宝玉](https://x.com/dotey \"@宝玉\")\n\nOct 9, 2025\n\n[\n\n### Detailed mirror-selfie otaku room scene\n\n](https://x.com/dotey/status/1976485558319722711)\n\n![Detailed mirror-selfie otaku room scene](https://cms-assets.youmind.com/media/1763889946850_689z0h_G23i3sJW0AASGUw-300x300.jpg)\n\nPREVIEW\n\nA very detailed Nano Banana prompt describing a female mirror selfie in a blue-toned otaku computer corner, with full specifications for character, environment, lighting, camera, and negative prompts.\n\nPromptOriginal\n\n\\### Scene Mirror selfie in an otaku-style computer corner, blue color tone. ### Subject \\* Gender expression: female \\* Age: around 25 \\* Ethnicity: East Asian \\* Body type: slim, with a defined waist; natural body proportions \\* Skin tone: light neutral tone \\* Hairstyle: \\* Length: waist-length hair \\* Style: straight with slightly curled ends \\* Color: medium brown \\* Pose: \\* Stance: standing in a slight contrapposto pose \\* Right hand: holding a smartphone in front of her face (identity hidden) \\* Left arm: naturally hanging down alongside the torso \\* Torso: body leaning slightly back; waist and abdomen exposed \\* Clothing: \\* Top: light blue cropped knit cardigan, top two buttons fastened; a blue French-style bra faintly visible \\* Bottom: denim ultra-short shorts, with a blue satin ribbon bow on each side of the hips \\* Socks: blue and white horizontal striped over-the-knee socks \\* Accessory: a blue cute mascot phone case ### Environment \\* Description: bedroom computer corner seen through a wall-mounted mirror \\* Furnishings: \\* White desk \\* Single monitor showing a soft blue wallpaper (no readable text) \\* Mechanical keyboard with white keycaps on a blue desk mat \\* Mouse on a small blue mouse pad \\* PC tower on the right side with blue case lighting \\* Three anime figures on or near the PC tower \\* A poster of a pagoda on the wall \\* Cat-shaped desk lamp with blue accents \\* A transparent glass of water \\* A tall green leafy plant by the window (on the left side of the frame) \\* Color replacement: replace all originally pink elements (clothes and room decor) with blue tones (baby blue to sky blue/periwinkle blue). ### Lighting \\* Light source: daylight coming from a large window on the left side of the camera, through sheer curtains \\* Light quality: soft, diffused light \\* White balance (K): 5200 ### Camera \\* Mode: smartphone rear camera shooting via the mirror (no portrait/bokeh mode) \\* Equivalent focal length (mm): 26 \\* Distances (m): \\* Subject to mirror: 0.6 \\* Camera to mirror: 0.5 \\* Exposure: \\* Aperture (f): 1.8 \\* ISO: 100 \\* Shutter speed (s): 0.01 \\* Exposure compensation (EV): -0.3 \\* Focus: focus on the torso and shorts in the mirror image \\* Depth of field: natural smartphone deep depth of field; background clearly visible with no artificial blur \\* Composition: \\* Aspect ratio: 1:1 \\* Crop: from the top of the head to mid-thigh; include the desk, monitor, PC tower, and plant in the frame \\* Angle: slightly high angle from the mirror’s point of view \\* Composition note: keep the subject centered; to avoid wide-angle edge distortion, have her stand a bit further away and crop to a square later. ### Negative prompts \\* Any appearance of pink/magenta anywhere \\* Beauty filters/over-smoothed skin; poreless skin look \\* Exaggerated or distorted anatomy \\* NSFW, see-through fabrics, wardrobe malfunctions \\* Logos, brand names, or readable user interface text \\* Fake portrait-mode blur, CGI/illustration feel\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@VoxcatAI](https://x.com/VoxcatAI \"@VoxcatAI\")\n\nDec 1, 2025\n\n[\n\n### Edo-period Ukiyo-e reinterpretation of a modern scene\n\n](https://x.com/VoxcatAI/status/1995497350543110411)\n\n![Edo-period Ukiyo-e reinterpretation of a modern scene](https://cms-assets.youmind.com/media/1764915832381_renotr_G7FuPlzbYAAsuo2-300x401.jpg)\n\nPREVIEW\n\nA highly-structured image prompt to depict a modern-day scene reimagined as an Edo-period Japanese Ukiyo-e woodblock print, with detailed guidance on anachronistic tech, composition, texture, and color.\n\nPrompt\n\nA Japanese Edo-period Ukiyo-e woodblock print (浮世絵 木版画). The overall feeling is a surreal collaboration between masters like Hokusai and Hiroshige, reimagining modern technology through an ancient lens. \\*\\*The Scene:\\*\\* 繁忙的涩谷十字路口 \\*\\*Edo Transformation Logic:\\*\\* Characters wear Edo-era kimono but perform modern actions. All technology is transformed into surreal Edo equivalents: \\* \\*\\*Smartphones\\*\\* are glowing, illustrated paper scrolls being read intently. \\* \\*\\*Metro stations/Trains\\*\\* are giant articulated wooden centipede carriages shuffling through crowds. \\* \\*\\*Skyscrapers\\*\\* are reimagined as endless, towering wooden pagodas reaching into dramatic clouds. \\* \\*\\*Robots/Mecha\\*\\* appear as giant, armored woodblock golems. The composition uses a flattened perspective with large, bold, hand-carved ink outlines (太い墨線). The background features heavily stylized Ukiyo-e wave patterns and dramatic, swirling clouds, with a distant Mt. Fuji visible on the horizon. The image must look like a physical print, not a digital painting. \\* \\*\\*Texture:\\*\\* Strong visible wood grain texture (木目) and rough paper fibers throughout the piece. \\* \\*\\*Printing Imperfections:\\*\\* Pigment bleeding is evident. Crucially, simulate hand-pressed plates with slight \\*\\*color misalignment (版ズレ)\\*\\* for authenticity. \\* \\*\\*Color Palette:\\*\\* Strictly limited to traditional mineral pigments. Dominant use of Prussian blue (浮世絵ブルー), vermilion red, and muted yellow ochre. \\* \\*\\*Lighting:\\*\\* Soft, flat, shadow-free lighting with no digital gradients. \\* \\*\\*Aspect Ratio:\\*\\* 3:4 vertical poster. \\* \\*\\*Extras:\\*\\* Include vertical Japanese calligraphy describing the scene and a traditional red artist seal stamp (落款) in a corner.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@K](https://x.com/ChillaiKalan__ \"@K\")\n\nNov 23, 2025\n\n[\n\n### Black and white studio side-profile portrait prompt\n\n](https://x.com/ChillaiKalan__/status/1992790080503902651)\n\n![Black and white studio side-profile portrait prompt](https://cms-assets.youmind.com/media/1764909188004_owsg5r_G6fQALWbMAAa0C--300x224.jpg)\n\nPREVIEW\n\nA concise Nano Banana Pro prompt for a hyper-realistic black and white studio portrait of a young man in side profile, using an attached reference image and specifying size and output count.\n\nPrompt\n\n{ \"Use the attached image of the person as reference. Hyper-realistic black and white studio portrait of the young man in side profile, natural hair gently falling around his face. Strong rim light accentuating his jawline and nose, dark minimalist background. Expression thoughtful and serene, cinematic lighting creating dramatic contrast and fine photographic detail.\", \"size\": \"1024x1024\", \"n\": 1 }\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@Marky @ Easy-Peasy.AI](https://x.com/easy_peasy_ai \"@Marky @ Easy-Peasy.AI\")\n\nDec 3, 2025\n\n[\n\n### 2005 Sony CyberShot mall food court snapshot prompt\n\n](https://x.com/easy_peasy_ai/status/1996232508162310472)\n\n![2005 Sony CyberShot mall food court snapshot prompt - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909293283_f5655t_G7QK4bqbsAEzqlB-300x300.jpg)\n\n![2005 Sony CyberShot mall food court snapshot prompt - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909295848_nioupc_G7QK4b-acAA2_c9-300x300.jpg)\n\nAn image prompt that recreates an early-digital-camera mall food court photo with teens, harsh flash, date stamp, and Myspace-era aesthetics.\n\nPrompt\n\nA low-resolution digital photo taken on a 2005 Sony CyberShot. A group of teenagers hanging out in a mall food court. Harsh on-camera flash, slightly blown-out highlights, digital noise in the shadows. The skin texture looks slightly waxy due to early digital processing. Orange date stamp in the bottom right corner reading \"04/12/2005\". Candid, awkward angles, Myspace photo aesthetic.\n\nTry it now\n\nPromptOriginal\n\nBY[@ttmouse - 豆爸](https://x.com/ttmouse \"@ttmouse - 豆爸\")\n\n1 day ago\n\n[\n\n### Nano Banana Pro Community Prompt Concepts Summary\n\n](https://x.com/ttmouse/status/2003112308319375843)\n\n![Nano Banana Pro Community Prompt Concepts Summary](https://cms-assets.youmind.com/media/1766489559958_58r1mn_G8x8AJIX0AAX7ny-300x623.jpg)\n\nPREVIEW\n\nThis tweet summarizes popular creative concepts and prompt types trending in the Nano Banana Pro community, including generating giant surreal monuments (like pencils), high-end functional drink concepts, rubber hose 3D cartoon characters, and dystopian book dioramas. It does not contain a single executable prompt but lists several high-level ideas.\n\nPromptOriginal\n\nPrompt for generating giant surreal monuments from everyday objects, such as pencils, creating surreal city sculpture scenes. Prompt for a high-end functional beverage concept from a non-beverage brand, sharing detailed cosmic high-aesthetics prompts. Prompt for rubber hose 3D style cartoon characters, generating a series of cute dynamic poses. Universal 3x3 grid advertising prompt perfectly achieving product consistency in Nano Banana Pro. Dreamy prompt for augmented reality Spotify play cards surrounding a person, generating sci-fi dynamic effects. Prompt for generating personalized sticker packs from uploaded photos, featuring cute designs in various clothing styles. Creative prompt for dystopian novel-themed miniature worlds inside open books, presented in a diptych format. Prompt for polymer clay style celebrity miniature dolls, generating cute, handcrafted-looking portraits. Prompt for generating Bollywood star social brand studio portraits from uploaded photos. Prompt for realistic 3D rendering scenes of fictional Arrow Dynamics equipment, visualizing high-end product concepts. Prompt for frozen tundra themed human scenes, generating a blend of cold-toned, magnificent nature. Prompt for giant cosmic hourglass mysterious scenes, directly outputting surreal cinematic works. Prompt for ancient Egyptian Eye of Horus stone wall with mysterious golden light, directly outputting classic mystical style. Simple prompt for generating a horror video effect where facial skin opens to reveal internal machinery. Prompt for Bollywood poster style Indian actress in a blue sari, creating elegant and dreamy compositions. Prompt for Knolling flat lay photography of popular items from one's birth year.\n\nTry it now\n\nPromptOriginal\n\nBY[@𝗦𝗮𝗻𝗶𝗮](https://x.com/saniaspeaks_ \"@𝗦𝗮𝗻𝗶𝗮\")\n\n1 day ago\n\n[\n\n### Birthday Poster Collage with Neon Text\n\n](https://x.com/saniaspeaks_/status/2003103090778759237)\n\n![Birthday Poster Collage with Neon Text - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489497108_8cn8z7_G8xzgaHaQAAPd6z-300x402.jpg)\n\n![Birthday Poster Collage with Neon Text - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489497009_fp4w7c_G8xzdU9a0AAOt1t-300x402.jpg)\n\n![Birthday Poster Collage with Neon Text - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489497426_yr9xle_G8xzdapbUAAwDZ--300x402.jpg)\n\n![Birthday Poster Collage with Neon Text - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489499276_8wn07q_G8xzdayaEAA5sLX-300x402.jpg)\n\nA structured prompt for generating a stylish, cinematic poster collage celebrating a birthday, featuring a woman (with strict identity preservation from a reference image) against a tropical wall background with integrated neon lights and glowing 'it’s my birthday!' text.\n\nPrompt\n\n{ \"type\": \"image\\_generation\\_prompt\", \"style\": \"stylish poster collage, cinematic, trendy, lifestyle editorial\", \"identity\\_preservation\": { \"use\\_uploaded\\_image\": true, \"alter\\_face\": false, \"strict\\_identity\\_lock\": true, \"notes\": \"Keep the woman from the attached image as the main character. Preserve her facial features, proportions, and overall identity exactly as in the reference.\" }, \"subject\": { \"gender\": \"female\", \"role\": \"fashion model / main character\", \"pose\": { \"style\": \"confident or relaxed\", \"body\\_language\": \"natural, stylish, self-assured\" }, \"expression\": \"confident, calm, or subtly playful\", \"outfit\": { \"style\": \"modern, cool, fashionable\", \"notes\": \"Outfit should enhance a trendy, contemporary aesthetic suitable for a magazine or social media poster\" } }, \"environment\": { \"background\": { \"type\": \"tropical wall\", \"elements\": \\[ \"lush green leaves\", \"soft neon lights integrated into the foliage\" \\], \"color\\_palette\": \"vibrant greens with neon accents\" } }, \"graphics\": { \"neon\\_text\": { \"content\": \"it’s my birthday!\", \"style\": \"glowing neon typography\", \"colors\": \\[ \"warm orange\", \"pink\" \\], \"placement\": \"balanced within the composition, clearly visible but not overpowering the subject\" } }, \"lighting\": { \"type\": \"soft, warm, cinematic lighting\", \"effects\": \\[ \"gentle shadows\", \"warm highlights on skin and outfit\", \"neon glow interacting with the subject\" \\] }, \"composition\": { \"focus\": \"strong central subject\", \"layout\": \"poster-like collage\", \"emphasis\": \\[ \"atmosphere\", \"composition\", \"glow and mood\" \\] }, \"color\\_grading\": { \"style\": \"natural yet vibrant\", \"tone\": \"warm with trendy neon accents\" }, \"quality\": { \"realism\\_level\": \"stylized rather than fully realistic\", \"detail\\_level\": \"clean, polished, editorial-quality finish\" }, \"mood\": { \"atmosphere\": \"cinematic, trendy, celebratory\", \"vibe\": \"modern lifestyle, social-media-ready\" }, \"constraints\": \\[ \"Do not change the woman’s face or identity\", \"Avoid overly realistic rendering\", \"No watermarks or logos\" \\], \"output\\_goal\": \"Create a stylish, cinematic poster-style collage featuring a woman from the reference image against a tropical neon background, with glowing celebratory text and a modern, fashionable aesthetic.\" }\n\nTry it now\n\nPromptOriginal\n\nBY[@松果先森](https://x.com/songguoxiansen \"@松果先森\")\n\n1 day ago\n\n[\n\n### Christmas Skincare Set Promotion Card\n\n](https://x.com/songguoxiansen/status/2003096613359853946)\n\n![Christmas Skincare Set Promotion Card](https://cms-assets.youmind.com/media/1766489525155_o9dyiz_G8xts6caYAAP660-300x537.jpg)\n\nPREVIEW\n\nA Nano banana pro prompt designed to generate a promotional card for a Christmas skincare product set. The card features a festive, warm, and luxurious aesthetic with a focus on the product packaging and a clear call to action.\n\nPromptOriginal\n\nChristmas skincare product set promotion card, warm tones, festive atmosphere, luxurious, highlighting product packaging, including promotion information, and a CTA button. Christmas Skincare Set, Limited Time Discount, Shop Now, 8k, ultra clear, cinematic, soft lighting, depth of field, product photography, exquisite, detailed, high quality\n\nTry it now\n\nPromptOriginal\n\nBY[@Indie Maker | AI](https://x.com/oslook_ \"@Indie Maker | AI\")\n\n1 day ago\n\n[\n\n### Infographic/Cover Design Style Template (LLM/Image)\n\n](https://x.com/oslook_/status/2003090197551177998)\n\n![Infographic/Cover Design Style Template (LLM/Image) - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489540045_9u5hln_G8xmNNOa8AAqcIE-300x164.jpg)\n\n![Infographic/Cover Design Style Template (LLM/Image) - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489540033_qeup4n_G8xmOoha8AAryJB-300x164.jpg)\n\nA simple template for generating infographics or cover designs using Nano Banana Pro, allowing the user to specify the desired style. Two example styles are provided: Retro/Vintage (using old fonts, textures, and tones, often combined with modern elements) and Hand-Drawn/Illustrative (friendly, warm, and personal, suitable for narrative content).\n\nPromptOriginal\n\nxxxxx, please generate an infographic, using the style 【xxxx】.\n\nTry it now\n\n[![TEDStylePPT](https://cdn.gooo.ai/gen-images/b3d627602514869a171e7e70dc6ade6f6b0cc2fa5753f34b6d2c31c0822d18d1.png@small)\n\nAI Shortcut\n\nInstall\n\n\n\n](https://youmind.com/shortcuts/61d89b76-3842-4a12-89c7-b54e3d66ab7c)\n\n[\n\n### TEDStylePPT\n\nTransform your ideas into captivating TED-style presentations. Craft compelling narratives and stunning visuals that inspire and engage, all with the click of a button.\n\n\n\n](https://youmind.com/shortcuts/61d89b76-3842-4a12-89c7-b54e3d66ab7c)[Install on YouMind](https://youmind.com/shortcuts/61d89b76-3842-4a12-89c7-b54e3d66ab7c)\n\nPromptOriginal\n\nBY[@Lex](https://x.com/lexx_aura \"@Lex\")\n\n1 day ago\n\n[\n\n### Red Slip Dress Bathroom Selfie Prompt\n\n](https://x.com/lexx_aura/status/2003044060680892497)\n\n![Red Slip Dress Bathroom Selfie Prompt](https://cms-assets.youmind.com/media/1766489466566_lboypl_G8w98P6XAAAXlKO-300x402.jpg)\n\nPREVIEW\n\nA detailed image generation prompt structured for a hyperrealistic flash photograph of a young woman in a vibrant red satin slip dress, leaning against a marble bathroom vanity. The prompt specifies subject details, clothing, pose, environment (modern luxury bathroom with reflections), and lighting (direct flash photography) to achieve an influencer-style candid snapshot.\n\nPrompt\n\n{   \"prompt\\_structure\": {     \"subject\": {       \"description\": \"Young woman with light skin tone\",       \"hair\": \"Long, voluminous dark brunette hair, styled in loose waves, center part, reaching past shoulders\",       \"face\": \"Oval face shape, light-colored eyes (appearing green or grey), soft makeup with defined eyeliner and neutral glossy lips\",       \"expression\": \"Neutral, alluring gaze, direct eye contact with the camera\"     },     \"clothing\": {       \"type\": \"Slip dress / Chemise\",       \"color\": \"Vibrant red\",       \"material\": \"Satin or silk finish with a glossy sheen\",       \"details\": \"Spaghetti straps, V-neckline with scalloped lace trim, lace detailing near the hem, mini length\",       \"accessories\": \"Small silver pendant necklace, ring on ring finger of left hand\"     },     \"pose\": {       \"stance\": \"Leaning backward against a bathroom vanity counter\",       \"arms\": \"Arms extended downward, hands gripping or resting on the edge of the marble countertop\",       \"orientation\": \"Front-facing\"     },     \"environment\": {       \"setting\": \"Modern luxury bathroom\",       \"elements\": \\[         \"White marble countertop\",         \"Dark wood vanity cabinetry\",         \"Large wall mirror behind subject\",         \"Circular magnifying mirror on a gold/brass stand\",         \"Glass shower door/enclosure in background\"       \\],       \"reflections\": \"Subject's back and hair visible in the large mirror behind her\"     },     \"lighting\\_and\\_style\": {       \"lighting\": \"Direct flash photography, bright front illumination with slight shadows behind the subject\",       \"aesthetic\": \"Influencer lifestyle, candid snapshot, high-fidelity, 'night out' preparation vibe\",       \"color\\_palette\": \"Red, warm skin tones, cool whites and dark browns in background\"     }   } }\n\nTry it now\n\nPromptOriginal\n\nBY[@Adam也叫吉米](https://x.com/Adam38363368936 \"@Adam也叫吉米\")\n\n1 day ago\n\n[\n\n### Christmas Box Challenge Photo Collage Prompt\n\n](https://x.com/Adam38363368936/status/2003025725675204789)\n\n![Christmas Box Challenge Photo Collage Prompt](https://cms-assets.youmind.com/media/1766489532891_40vkn5_G8wsmbracAEoQKc-300x504.jpg)\n\nPREVIEW\n\nA highly specific prompt for Nano Banana Pro to generate an ultra-realistic, high-quality 2x2 creative photo collage of a young woman posing inside cardboard boxes for a Christmas-themed challenge. The prompt emphasizes panel layout and interaction, specifically requiring a continuous action (red wine pouring) across the two right-hand panels, while maintaining the subject's face without change.\n\nPrompt\n\nUse the face without any change.A high-quality 2x2 creative photo collage of a young woman with long wavy black hair , posing inside cardboard boxes for a Christmas-themed challenge. She wears a cream, red, and green Fair Isle knit sweater. Layout & Interaction (Crucial):The right side features a continuous action across two panels. Red wine is poured from the top-right panel and flows vertically down into the bottom-right panel. Panel Details: Top Left: She blows artificial snow from her palms towards the camera. Bottom Left: She holds glowing fairy lights and a red bauble, smiling warmly. Top Right: She leans on the box edge, holding a wine bottle, pouring red wine downwards so the liquid stream exits the bottom of this frame. Bottom Right: She is positioned below, holding a wine glass that catches the stream of wine pouring down from the panel above. She is looking up, watching the wine flow into her glass. Style: Creative box challenge photography, seamless cross-panel interaction, festive mood, soft studio lighting, ultra-realistic textures.\n\nTry it now\n\nPromptOriginal\n\nBY[@Lore](https://x.com/l_w_lorenzen \"@Lore\")\n\n1 day ago\n\n[\n\n### E-Girl Y2K Flash Selfie Prompt\n\n](https://x.com/l_w_lorenzen/status/2002997024996892830)\n\n![E-Girl Y2K Flash Selfie Prompt](https://cms-assets.youmind.com/media/1766489558942_eqiqvu_G8wTKYZbMAAifq_-300x300.jpg)\n\nPREVIEW\n\nA prompt for generating a high-angle, high-contrast selfie image with a Y2K grunge/E-girl aesthetic. It specifies the subject's silver-grey hair in pigtails, heavy eyeliner, a corset top, and a silver cross necklace, set in a dimly lit bedroom with purple LED accent lighting and harsh direct flash photography.\n\nPrompt\n\n{ \"image\\_generation\\_prompt\": { \"subject\": { \"demographics\": \"Young woman, fair skin, slim build\", \"hair\": { \"color\": \"{argument name=\\\\\"hair color\\\\\" default=\\\\\"Silver grey\\\\\"}\", \"style\": \"High pigtails, straight texture\", \"details\": \"Bangs framing the forehead and sides of the face\" }, \"face\\_and\\_makeup\": { \"eyes\": \"Green/hazel eyes, heavy winged eyeliner, long lashes\", \"expression\": \"Sultry gaze, slightly parted lips\", \"action\": \"Right index finger touching lower lip or corner of mouth\" } }, \"attire\": { \"clothing\": \"Sleeveless corset-style top with deep scoop neckline and visible hook-and-eye closures, partially visible skirt or shorts\", \"accessories\": \"Silver cross pendant necklace on a thin chain\" }, \"pose\": { \"type\": \"High-angle selfie\", \"body\\_position\": \"Arm extended toward camera, body angled slightly\" }, \"setting\": { \"location\": \"Bedroom interior\", \"background\\_elements\": \\[ \"Large white textured pillows (tufted or knit)\", \"White sheets\", \"Dark wall\" \\], \"ambient\\_lighting\": \"Purple LED strip light running horizontally behind the headboard\", \"atmosphere\": \"Dimly lit room with colored accent lighting\" }, \"style\\_and\\_technical\": { \"aesthetic\": \\[ \"E-girl\", \"Y2K grunge\", \"2000s digital aesthetic\" \\], \"lighting\\_technique\": \"Direct on-camera flash, harsh high-contrast lighting on subject against darker background\", \"camera\\_settings\": { \"angle\": \"High-angle wide selfie\", \"distortion\": \"Slight wide-angle distortion\", \"color\\_profile\": \"Full color, natural color rendering with vibrant neon purple accent\" }, \"aspect\\_ratio\": \"3:4\" } }\n\nTry it now\n\nPromptOriginal\n\nBY[@Melisa♡](https://x.com/xmliisu \"@Melisa♡\")\n\n1 day ago\n\n[\n\n### 3x3 Collage of Beauty Product Flat Lays and Portraits\n\n](https://x.com/xmliisu/status/2002983283429146835)\n\n![3x3 Collage of Beauty Product Flat Lays and Portraits](https://cms-assets.youmind.com/media/1766489486966_b2hn59_G8wGrKjXsAAgrAb-300x537.jpg)\n\nPREVIEW\n\nA highly detailed, structured prompt for generating a 3x3 grid collage featuring a young woman with vibrant red hair, wearing a maroon corset dress, showcasing gold dangle earrings, cosmetics, and various poses/reflections in a luxury interior setting.\n\nPrompt\n\n{ \"image\\_composition\": { \"type\": \"Collage\", \"layout\": \"3x3 Grid\", \"total\\_panels\": 9 }, \"subject\\_details\": { \"appearance\": \"Young woman with fair skin\", \"hair\": { \"color\": \"Vibrant red\", \"style\": \"Loose waves, shoulder-length, side-parted\", \"texture\": \"Silky and voluminous\" }, \"eyes\": \"Blue/Green\", \"expression\": \"Varied (serious, smiling, laughing, focused)\" }, \"fashion\\_and\\_style\": { \"outfit\": { \"garment\": \"Strapless corset-style dress or top\", \"color\": \"Deep maroon / Berry\", \"fabric\": \"Satin or Silk\", \"details\": \"Ruched bodice, structural boning visible\" }, \"makeup\": { \"style\": \"Natural glam\", \"features\": \"Glowing skin, soft blush, defined lashes, nude/pink glossy lips\" } }, \"jewelry\\_focus\": { \"item\\_type\": \"Dangle Earrings\", \"metal\": \"Gold\", \"design\\_elements\": \\[ \"Huggie hoop base\", \"Large sunburst/starburst main charm\", \"Pave set crystals\", \"Delicate hanging chains\", \"Small star charms at ends of chains\" \\] }, \"setting\\_and\\_environment\": { \"location\": \"Luxury interior (likely a hotel suite or upscale bathroom)\", \"key\\_features\": \\[ \"Large rectangular mirror with integrated LED lighting border\", \"White marble countertops\", \"Wood paneling on walls\", \"Large floor-to-ceiling windows\", \"Beige curtains\" \\], \"lighting\": \"Mix of natural daylight and warm artificial vanity lighting\" }, \"props\\_and\\_objects\": { \"cosmetics\": \\[ \"Lip gloss tube\", \"Mascara/Eyeliner tube\", \"Glass perfume bottle with gold cap\", \"Round compact powder\" \\], \"tech\": \"Black smartphone\", \"background\\_props\": \"Beige silk/satin fabric cloth (in flat lay)\" }, \"panel\\_breakdown\": { \"top\\_row\": \\[ \"Reflection in lit mirror applying makeup\", \"Flat lay of jewelry and cosmetics on marble\", \"Close-up putting on earring near window\" \\], \"middle\\_row\": \\[ \"Extreme close-up of earring on ear\", \"Side profile focusing on hair texture and shoulder\", \"Waist-up portrait facing forward near window\" \\], \"bottom\\_row\": \\[ \"Portrait touching hair looking away\", \"Reflection in mirror laughing/smiling\", \"Flat lay of earrings on folded beige silk cloth\" \\] } }\n\nTry it now\n\nPromptOriginal\n\nBY[@Lore](https://x.com/l_w_lorenzen \"@Lore\")\n\n1 day ago\n\n[\n\n### Platinum Blonde Bedroom Mirror Selfie Prompt (Detailed)\n\n](https://x.com/l_w_lorenzen/status/2002972442512519404)\n\n![Platinum Blonde Bedroom Mirror Selfie Prompt (Detailed)](https://cms-assets.youmind.com/media/1766489489320_rleskv_G8v8sbOacAARcjP-300x300.jpg)\n\nPREVIEW\n\nA highly detailed, structured prompt for generating a vertical mirror selfie of a platinum blonde woman in loungewear (ribbed tank and boy shorts) in a cozy bedroom setting, focusing on the 'classic high-angle mirror selfie pose' and specific details like phone accessories and lighting.\n\nPrompt\n\n{ \"subject\": { \"description\": \"Young woman taking bedroom mirror selfie, phone held high, casual loungewear moment\", \"age\": \"early 20s\", \"expression\": { \"eyes\": \"looking up at phone screen, soft doe eyes\", \"mouth\": \"soft pout, lips slightly pursed\", \"overall\": \"that 'checking my angles' focused selfie face\" }, \"hair\": { \"color\": \"platinum blonde, white-silver\", \"style\": \"messy high ponytail, loose and undone\", \"details\": \"lots of pieces falling out, face-framing strands, effortless messy\" }, \"body\": { \"frame\": \"petite, slim, toned\", \"waist\": \"small, defined, bare midriff\", \"stomach\": \"flat, toned, fully visible\", \"hips\": \"feminine curve\" }, \"pose\": { \"phone\\_arm\": \"raised HIGH above head, extended up\", \"other\\_arm\": \"down, hand resting on hip/thigh\", \"stance\": \"slight hip cock, weight shifted\", \"torso\": \"slight twist, elongated from raised arm\", \"overall\": \"the classic high-angle mirror selfie pose\" }, \"clothing\": { \"top\": { \"type\": \"Blake ribbed tank top\", \"fit\": \"fitted, cropped above belly button\", \"neckline\": \"scoop neck, simple\", \"effect\": \"basic but shows shape\" }, \"bottom\": { \"type\": \"White cotton boy shorts / mini shorts\", \"fit\": \"tight, very short, sits low on hips\", \"style\": \"lounge shorts, underwear-adjacent\", \"effect\": \"barely there, shows legs completely\" } }, \"accessories\": { \"phone\": \"iPhone with MagSafe ring, clear case\", \"hair\\_tie\": \"scrunchie in ponytail\", \"jewelry\": \"minimal, maybe small earrings\" } }, \"environment\": { \"location\": \"bedroom\", \"mirror\": \"full-length standing mirror\", \"room\\_details\": { \"bed\": \"visible in reflection, unmade, grey/beige bedding\", \"lamp\": \"warm bedside lamp glowing\", \"chair\": \"gaming/desk chair with clothes draped\", \"lights\": \"LED strip lights on wall\", \"clothes\": \"scattered on chair, lived-in\" }, \"lighting\": \"warm lamp light + LED strips, cozy evening\" }, \"photography\": { \"style\": \"mirror selfie, high angle\", \"framing\": \"thighs to above head\", \"angle\": \"phone above head shooting down\", \"quality\": \"iPhone\", \"aspect\": \"4:5 vertical\" }, \"color\\_story\": { \"her\": \"white tank, grey shorts, platinum hair\", \"room\": \"beige walls, grey bedding, warm lamp glow\", \"palette\": \"neutral, soft, cozy tones\" }, \"vibe\": { \"energy\": \"casual night in, loungewear content\", \"mood\": \"effortless, 'just hanging out'\", \"authenticity\": \"real bedroom, real mess, real girl\", \"caption\": \"'fit check' or 'staying in' or '🤍'\" } }\n\nTry it now\n\nPromptOriginal\n\nBY[@Melisa♡](https://x.com/xmliisu \"@Melisa♡\")\n\n1 day ago\n\n[\n\n### E-girl Y2K Grunge Selfie Prompt\n\n](https://x.com/xmliisu/status/2002937136815993283)\n\n![E-girl Y2K Grunge Selfie Prompt - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489516575_0fzbgz_G8uGICQXQAIK0d9-300x402.jpg)\n\n![E-girl Y2K Grunge Selfie Prompt - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489516821_8c79ab_G8uGICLXwAA_kM1-300x402.jpg)\n\nA structured prompt designed to generate an 'E-girl' style, high-angle mirror selfie with a Y2K grunge aesthetic. It specifies silver-grey hair in pigtails, heavy makeup, a corset top, and a dimly lit bedroom setting with purple LED accent lighting and harsh direct flash.\n\nPrompt\n\n{ \"image\\_generation\\_prompt\": { \"subject\": { \"demographics\": \"Young woman, fair skin, slim build\", \"hair\": { \"color\": \"Silver grey\", \"style\": \"High pigtails, straight texture\", \"details\": \"Bangs framing the forehead and sides of the face\" }, \"face\\_and\\_makeup\": { \"eyes\": \"Green/hazel eyes, heavy winged eyeliner, long lashes\", \"expression\": \"Sultry gaze, slightly parted lips\", \"action\": \"Right index finger touching lower lip or corner of mouth\" } }, \"attire\": { \"clothing\": \"Sleeveless corset-style top with deep scoop neckline and visible hook-and-eye closures, partially visible skirt or shorts\", \"accessories\": \"Silver cross pendant necklace on a thin chain\" }, \"pose\": { \"type\": \"High-angle selfie\", \"body\\_position\": \"Arm extended toward camera, body angled slightly\" }, \"setting\": { \"location\": \"Bedroom interior\", \"background\\_elements\": \\[ \"Large white textured pillows (tufted or knit)\", \"White sheets\", \"Dark wall\" \\], \"ambient\\_lighting\": \"Purple LED strip light running horizontally behind the headboard\", \"atmosphere\": \"Dimly lit room with colored accent lighting\" }, \"style\\_and\\_technical\": { \"aesthetic\": \\[ \"E-girl\", \"Y2K grunge\", \"2000s digital aesthetic\" \\], \"lighting\\_technique\": \"Direct on-camera flash, harsh high-contrast lighting on subject against darker background\", \"camera\\_settings\": { \"angle\": \"High-angle wide selfie\", \"distortion\": \"Slight wide-angle distortion\", \"color\\_profile\": \"Full color, natural color rendering with vibrant neon purple accent\" }, \"aspect\\_ratio\": \"3:4\" } } }\n\nTry it now\n\nPromptOriginal\n\nBY[@はろ | AI活用とHALO式スライド](https://x.com/haro_marketing \"@はろ | AI活用とHALO式スライド\")\n\n2 days ago\n\n[\n\n### Ballpoint Pen Drawing of Umaibo Comparison\n\n](https://x.com/haro_marketing/status/2002869182917124238)\n\n![Ballpoint Pen Drawing of Umaibo Comparison - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489555401_htpz7w_G8ue4NDbcAABPi1-300x164.jpg)\n\n![Ballpoint Pen Drawing of Umaibo Comparison - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489555187_5jvvtu_G8ue3sObsAA8eFK-300x450.jpg)\n\nThis tweet compares the output of Nano Banana Pro and GPT Image 1.5 using the same prompt to generate an image of the snack 'Umaibo' rendered in a ballpoint pen drawing style.\n\nPromptOriginal\n\nPlease generate an image of Umaibo drawn with a ballpoint pen.\n\nTry it now\n\nPromptOriginal\n\nBY[@けこねこ](https://x.com/soranoblue3 \"@けこねこ\")\n\n2 days ago\n\n[\n\n### Star Present for an Angel Girl\n\n](https://x.com/soranoblue3/status/2002865913520173097)\n\n![Star Present for an Angel Girl](https://cms-assets.youmind.com/media/1766489542280_kxkawu_G8ub7d_aIAAa9tP-300x402.jpg)\n\nPREVIEW\n\nA prompt used with Nano Banana Pro to generate an image of a star present for an angel girl, likely used for a holiday greeting or seasonal content.\n\nPromptOriginal\n\nA slightly early star present for you from yesterday's angel girl~.｡.:\\*☆\n\nTry it now\n\n[![Geek-style ASCII character poster](https://cdn.gooo.ai/web-images/c9c0bb4f1c7b0554a21d97ed26ffc5a64e10d33c3d1b70526ef72f11ea9bdb0d@small)\n\nAI Shortcut\n\nInstall\n\n\n\n](https://youmind.com/shortcuts/9c9c2803-4297-419a-b5f3-f13b8fbdf5c5)\n\n[\n\n### Geek-style ASCII character poster\n\nTransform your ideas into stunning Swiss-ASCII posters. Generate mathematically precise, full-bleed designs with glowing ASCII objects and perfect grid alignment, all in seconds.\n\n\n\n](https://youmind.com/shortcuts/9c9c2803-4297-419a-b5f3-f13b8fbdf5c5)[Install on YouMind](https://youmind.com/shortcuts/9c9c2803-4297-419a-b5f3-f13b8fbdf5c5)\n\nPromptOriginal\n\nBY[@Sienna](https://x.com/siennalovesai \"@Sienna\")\n\n2 days ago\n\n[\n\n### Gym Pose Portrait with Reference Image Adherence\n\n](https://x.com/siennalovesai/status/2002861078888272203)\n\n![Gym Pose Portrait with Reference Image Adherence](https://cms-assets.youmind.com/media/1766489504497_9qkfhz_G8uXiCBXsAAoSzJ-300x537.jpg)\n\nPREVIEW\n\nA structured JSON prompt for generating a medium-full shot portrait of a fit woman posing in a gym, specifically looking back over her shoulder. Crucially, the prompt includes explicit instructions for strict adherence to an uploaded reference image for facial features and body proportions.\n\nPrompt\n\n{ \"image\\_generation\\_request\": { \"parameters\": { \"aspect\\_ratio\": \"9:16\", \"model\\_version\": \"v6.0\", \"stylize\": 250, \"quality\": \"high\" }, \"reference\\_settings\": { \"use\\_reference\\_image\": true, \"consistency\\_weight\": 1.0, \"instruction\": \"Strict adherence to uploaded reference image. Maintain exact facial features and body proportions with 0% deviation.\" }, \"prompt\\_structure\": { \"subject\": { \"demographics\": { \"gender\": \"Female\", \"physique\": \"Fit, toned\", \"hair\\_style\": \"Long straight black hair\" }, \"apparel\": { \"upper\\_body\": { \"item\": \"Tank top\", \"color\": \"Pink\", \"fit\": \"Athletic/Tight\" }, \"lower\\_body\": { \"item\": \"Athletic shorts\", \"color\": \"Gray\", \"texture\": \"Soft fabric\", \"fit\": \"Form-fitting/Highlighting physique\" } }, \"pose\\_and\\_expression\": { \"body\\_orientation\": \"Looking back over shoulder\", \"facial\\_expression\": \"Slight smile\", \"action\": \"Standing/Posing\" } }, \"environment\": { \"setting\\_type\": \"Indoor Gym\", \"architectural\\_details\": { \"wall\\_color\": \"White\", \"accents\": \"Blue\", \"flooring\": \"Standard gym flooring\" }, \"props\\_and\\_equipment\": \\[ \"Various exercise machines\", \"Gym equipment in background\" \\], \"lighting\": { \"source\": \"Overhead\", \"quality\": \"Artificial, bright\" } }, \"composition\": { \"camera\\_angle\": \"Eye level\", \"framing\": \"Medium-full shot\", \"focus\": \"Sharp focus on subject\" } } } }\n\nTry it now\n\nPromptOriginal\n\nBY[@KeorUnreal](https://x.com/KeorUnreal \"@KeorUnreal\")\n\n2 days ago\n\n[\n\n### Gold Symbiote Mirror Selfie Prompt\n\n](https://x.com/KeorUnreal/status/2002854337475678587)\n\n![Gold Symbiote Mirror Selfie Prompt](https://cms-assets.youmind.com/media/1766489557239_jx2f4f_G8uRZojWQAAtsno-300x537.jpg)\n\nPREVIEW\n\nA detailed JSON prompt for Nano Banana Pro to generate a photorealistic, high-quality mirror selfie of a woman wearing a form-fitting gold symbiote-inspired superhero bodysuit in a dimly lit luxury bathroom, emphasizing a lo-fi social media aesthetic and specific makeup details.\n\nPrompt\n\n{ \"shot\": \"A tight close-up mirror selfie\", \"subject\": { \"appearance\": \"a stunning woman\", \"hair\": \"short hair\", \"pose\": \"sitting casually sideways on a white bathroom vanity counter\", \"gaze\": \"looking at the mirror\" }, \"outfit\": { \"bodysuit\": \"form-fitting gold symbiote-inspired superhero bodysuit with subtle dark web texturing\", \"emblem\": \"prominent white spider emblem on the chest\" }, \"phone\": { \"device\": \"red smartphone\", \"case\": \"white spider logo case\", \"action\": \"holding it up to capture the reflection\" }, \"environment\": { \"location\": \"luxury bathroom\", \"lighting\": \"dimly lit with warm, soft indoor lighting\", \"atmosphere\": \"intimate atmosphere with soft shadows\", \"visible\\_elements\": \"only a partial section of the white sink basin and counter surface visible at the bottom of the frame\", \"mirror\": \"mirror edges are cropped out of view\" }, \"aesthetic\": \"high quality, photorealistic, lo-fi social media aesthetic\", \"makeup\": { \"blush\": \"prominent soft pink blush on her cheeks\", \"finish\": \"glowy makeup\", \"highlighter\": \"on the tip of her nose\", \"lips\": \"slightly parted soft warm pink lips\" }, \"skin\": \"highly detailed skin texture\" \"lighting\\_detail\": \"even, invisible front illumination that softly brightens the face with neutral white light, no visible light source, no shadows, no reflections, no hotspots\", \"quality\": \"no blur\" }\n\nTry it now\n\nPromptOriginal\n\nBY[@セレナ](https://x.com/serena_ailab \"@セレナ\")\n\n2 days ago\n\n[\n\n### Nostalgic Japanese Flip Phone (Garakei) Display Generator\n\n](https://x.com/serena_ailab/status/2002854097494687964)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489550601_gq9cgn_G8uNwLBakAA1I5a-300x537.jpg)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489551094_rsidua_G8uNwLEa4AARSjR-300x537.jpg)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489552510_mt7jit_G8uNwK8a0AAApyl-300x537.jpg)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489551136_8bniot_G8uNwLEaMAAXX9v-300x300.jpg)\n\nThis prompt uses Nano Banana Pro to embed an uploaded image onto the small LCD screen of an early 2000s Japanese flip phone (garakei). The scene is styled with nostalgic elements like pixelated edges, pastel beaded straps, photo stickers, and gel pens, evoking a 'kawaii' and emotional retro aesthetic.\n\nPrompt\n\nDisplay the subject from the attached image on a flip phone (garakei) LCD screen from early 2000s Japan. The phone is open, with glossy pink or white shell, physical buttons, and simple beaded straps with pastel colored beads. The screen shows the image with pixelated edges and warm color saturation typical of 2000s mobile displays. Surrounded by nostalgic items like photo stickers, gel pens, and mini notebooks. Nostalgic, kawaii, emotional, soft lighting.\n\nTry it now\n\nPromptOriginal\n\nBY[@てんねん](https://x.com/munou_ac \"@てんねん\")\n\n2 days ago\n\n[\n\n### Nano Banana Pro X Header Image Generation Prompt\n\n](https://x.com/munou_ac/status/2002850192207597760)\n\n![Nano Banana Pro X Header Image Generation Prompt - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489525059_2o3mqx_G8uNoWzaAAA1VwE-300x99.jpg)\n\n![Nano Banana Pro X Header Image Generation Prompt - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489525611_5q0gkx_G8uNocrboAAp-oB-300x99.jpg)\n\n![Nano Banana Pro X Header Image Generation Prompt - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489525731_bqh21d_G8uNoWyaoAAOvlV-300x99.jpg)\n\n![Nano Banana Pro X Header Image Generation Prompt - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489526547_e79955_G8uNoWzbIAAN3N7-300x99.jpg)\n\nThis is a detailed prompt designed for Nano Banana Pro to generate an X (Twitter) header image based on a reference image. It includes a custom logo design based on user-specified text and a style preset, and offers options for face zooming to control the composition within a defined safe zone. It's an updated version of a previous prompt, focusing on practicality for profile image creation.\n\nPromptOriginal\n\n\\# ===== USER CONTROLS ===== title\\_text: \"<<YOUR\\_TEXT>>\" title\\_style\\_preset: \"cool\" # cool, cute, cool\\_cute, luxury, pop, cyber, minimal, retro, kawaii face\\_zoom: \"off\" # off, on subject: > Create a 3:1 wide banner using the provided reference image content. The primary face must be centered inside an invisible safe zone (not drawn), and a title logo (derived from title\\_text + title\\_style\\_preset) must be placed inside the same safe zone. composition: > Aspect ratio 3:1. Invisible safe zone (DO NOT draw it): - Left margin: 15% of width - Right margin: 15% of width - Top margin: 16% of height - Bottom margin: 16% of height Keep the entire face AND the entire title logo fully inside this safe zone. Background may extend to the edges. action: > Place the reference image content with maximum fidelity. Auto-crop/scale/reposition to fit a 3:1 banner with no stretching. Detect the primary face (if multiple faces, pick the largest/most prominent). Center the primary face within the safe zone both horizontally and vertically. Never crop off the face/eyes; keep the full face comfortably inside the safe zone (not near edges). Face zoom behavior: - If face\\_zoom is OFF: keep the original framing as much as possible while still centering the face in the safe zone. - If face\\_zoom is ON: zoom/crop to a bust-up portrait centered on the face (head and shoulders visible; include upper chest; do not crop the top of the head or chin; keep facial features prominent). Create negative space inside the safe zone for the title logo by adjusting crop/reposition/out\n\nTry it now\n\nPromptOriginal\n\nBY[@ANKIT PATEL 🇮🇳 | AI](https://x.com/Ankit_patel211 \"@ANKIT PATEL 🇮🇳 | AI\")\n\n2 days ago\n\n[\n\n### Hyper-Realistic 3D Architectural Exhibition Booth Visualization\n\n](https://x.com/Ankit_patel211/status/2002846579137577429)\n\n![Hyper-Realistic 3D Architectural Exhibition Booth Visualization - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489504133_fx2tzq_G8uKWVwbsAA400C-300x300.jpg)\n\n![Hyper-Realistic 3D Architectural Exhibition Booth Visualization - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489504696_5ekkfa_G8uKWWWbIAAHs7J-300x300.jpg)\n\nA template prompt for generating hyper-realistic 3D architectural visualizations of a two-story exhibition booth for a brand like Tesla. It uses placeholders for style, form, materials, and features, focusing on photorealistic rendering, specific lighting, and a cutting-edge tech aesthetic.\n\nPrompt\n\nHyper-realistic 3D architectural visualization of a \\[STYLE: e.g., minimalist/futuristic\\] two-story exhibition booth for Tesla, set against a solid dark grey studio background. The structure features \\[FORM: e.g., sweeping angular geometry with clean lines\\] design constructed from \\[MATERIAL: e.g., matte anodized aluminum and tempered glass\\] with \\[COLOR: e.g., Tesla signature red (#E82127) accents and charcoal black\\]. The ground floor centers around \\[GROUND-FEATURE: e.g., an interactive EV display platform with integrated LED floor lighting\\], reflecting Tesla’s focus on innovation and sustainability. A \\[STAIRS-TYPE: e.g., cantilevered floating staircase with glass balustrades\\] leads to the upper mezzanine level, designed as \\[UPPER-FEATURE: e.g., a collaborative lounge and consultation area with panoramic brand graphics and natural light simulation\\]. The lighting is \\[LIGHTING: e.g., soft natural daylight balanced with focused architectural accent lights\\], creating high-quality shadows and depth. The perspective is a wide-angle elevated view, capturing a \\[VIBE: e.g., cutting-edge tech minimalism with energetic brand presence\\] aesthetic, rendered with photorealistic textures.\n\nTry it now\n\nPromptOriginal\n\nBY[@Sienna](https://x.com/siennalovesai \"@Sienna\")\n\n2 days ago\n\n[\n\n### Baby Blue Polka Dot Top Bathroom Selfie Prompt\n\n](https://x.com/siennalovesai/status/2002845777840706047)\n\n![Baby Blue Polka Dot Top Bathroom Selfie Prompt](https://cms-assets.youmind.com/media/1766489561160_i6m9fm_G8uJnTPXsAAffsp-300x372.jpg)\n\nPREVIEW\n\nA prompt for generating a glamorous, flirtatious fashion snapshot. The subject has platinum blonde hair in a sleek high ponytail, wearing a baby blue polka-dot strapless top and low-rise white jeans, posing in a luxurious marble bathroom with a teasing gaze.\n\nPrompt\n\n{ \"aspect\\_ratio\": \"4:5\", \"scene\\_type\": \"indoor fashion snapshot\", \"environment\": { \"location\": \"luxurious bathroom\", \"background\": { \"wall\": \"marble wall\", \"mirror\": \"large mirror edge visible\" } }, \"subject\": { \"hair\": { \"color\": \"platinum blonde\", \"length\": \"long\", \"style\": \"high sleek ponytail\" }, \"wardrobe\": { \"top\": { \"item\": \"strapless fitted top\", \"color\": \"{argument name=\\\\\"top color\\\\\" default=\\\\\"baby blue\\\\\"}\", \"pattern\": \"small black polka dots\" }, \"bottom\": { \"item\": \"low-rise white denim jeans\" } }, \"accessories\": { \"bag\": { \"type\": \"small silver shoulder bag\" }, \"nails\": { \"color\": \"soft blue\" } }, \"pose\": { \"hand near mouth, direct teasing gaze\" } }, \"mood\": { \"vibe\": \"confident, glamorous, flirtatious\" } }\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@Nicolechan](https://x.com/stark_nico99 \"@Nicolechan\")\n\nNov 20, 2025\n\n[\n\n### Wide quote card with portrait and Chinese/English customization\n\n](https://x.com/stark_nico99/status/1991718646570426763)\n\n![Wide quote card with portrait and Chinese/English customization - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886933714_5zqn1e_G6QBjQHbgAE3Yt_-300x168.jpg)\n\n![Wide quote card with portrait and Chinese/English customization - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886938314_wbcfc7_G6QBiiracAInQ8z-300x168.jpg)\n\n![Wide quote card with portrait and Chinese/English customization - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886941069_1d9ace_G6QBii_acAIRxKd-300x127.jpg)\n\n![Wide quote card with portrait and Chinese/English customization - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886946388_nwahev_G6QBikOaEAAmYkO-300x166.jpg)\n\nA prompt for generating a wide quote card featuring a famous person’s portrait, with a brown background, light-gold serif quote text, and layout where text occupies two-thirds and the person one-third. The quote text and author are parameterized for reuse.\n\nPromptOriginal\n\nA wide quote card featuring a famous person, with a brown background and a light-gold serif font for the quote: “Stay Hungry, Stay Foolish” and smaller text: “—Steve Jobs.” There is a large, subtle quotation mark before the text. The portrait of the person is on the left, the text on the right. The text occupies two-thirds of the image and the portrait one-third, with a slight gradient transition effect on the portrait.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@Florian Gallwitz](https://x.com/FlorianGallwitz \"@Florian Gallwitz\")\n\nNov 21, 2025\n\n[\n\n### Watercolor map of Germany with labeled states\n\n](https://x.com/FlorianGallwitz/status/1991796624646091091)\n\n![Watercolor map of Germany with labeled states](https://cms-assets.youmind.com/media/1763886061720_fzgqaq_G6RIeSZXgAA7cOf-300x164.jpg)\n\nPREVIEW\n\nA German prompt to generate a watercolor-style map of Germany where all federal states are labeled in ballpoint pen, useful for educational or infographic-style maps.\n\nPromptOriginal\n\nGenerate a map of Germany in watercolor style, on which all federal states are labeled in ballpoint pen.\n\nTry it now\n\n![Nano Banana Pro Hands-On: 10 Mind-Blowing Real-World Cases](https://cms-assets.youmind.com/media/1763948516286_6slrwd_Generated_Image_November_24_2025_-_9_41AM-900x604.jpg)\n\nBLOG\n\n### Nano Banana Pro Hands-On: 10 Mind-Blowing Real-World Cases\n\n[EXPLORE MORE CASES](https://youmind.com/blog/nano-banana-pro-10-real-cases)\n\nPromptOriginal\n\nFeatured\n\nBY[@Johnn](https://x.com/john_my07 \"@Johnn\")\n\nDec 3, 2025\n\n[\n\n### London outdoor restaurant portrait with Nano Banana Pro\n\n](https://x.com/john_my07/status/1996230085645623770)\n\n![London outdoor restaurant portrait with Nano Banana Pro - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909307226_bcwb2i_G7QIraQaoAANflM-300x300.jpg)\n\n![London outdoor restaurant portrait with Nano Banana Pro - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909309972_89pbp7_G7QIrrebwAAGCPK-300x300.jpg)\n\nA photorealistic prompt for a young woman at a calm London outdoor restaurant on a crisp March morning, with shallow depth of field and candid phone-photo vibes.\n\nPrompt\n\nCreate a photorealistic image of a young woman sitting at a relaxed outdoor restaurant in London on a cool Wednesday morning in March 2025. The sky is clear, the spring air is crisp, and the city feels calm as it wakes up. She is the focal point of the shot—wearing a light scarf, gently stirring her tea while gazing off to the side with a thoughtful expression. Everything behind her, from the waiter moving about to the soft morning traffic, should fall into a smooth blur, giving the picture the effortless, candid atmosphere of a moment casually snapped on a phone.\n\nTry it now\n\n[![WordsCard](https://cdn.gooo.ai/web-images/5e0199359a6eb05237a68c9cdc7e6d650f01bf6532a91f73e5fad5541088c17c@small)\n\nAI Shortcut\n\nInstall\n\n\n\n](https://youmind.com/shortcuts/dc2099fa-32d7-465a-a5d2-70388b11d8bd)\n\n[\n\n### WordsCard\n\nLike a professional designer, generate high-quality children's literacy flashcards with one click. Realistic patterns, soft backgrounds, standard phonetic notations—instantly elevating teaching efficiency.\n\n\n\n](https://youmind.com/shortcuts/dc2099fa-32d7-465a-a5d2-70388b11d8bd)[Install on YouMind](https://youmind.com/shortcuts/dc2099fa-32d7-465a-a5d2-70388b11d8bd)\n\nPromptOriginal\n\nFeatured\n\nBY[@VoxcatAI](https://x.com/VoxcatAI \"@VoxcatAI\")\n\nDec 1, 2025\n\n[\n\n### Edo-period Ukiyo-e reinterpretation of a modern scene\n\n](https://x.com/VoxcatAI/status/1995497350543110411)\n\n![Edo-period Ukiyo-e reinterpretation of a modern scene](https://cms-assets.youmind.com/media/1764915832381_renotr_G7FuPlzbYAAsuo2-300x401.jpg)\n\nPREVIEW\n\nA highly-structured image prompt to depict a modern-day scene reimagined as an Edo-period Japanese Ukiyo-e woodblock print, with detailed guidance on anachronistic tech, composition, texture, and color.\n\nPrompt\n\nA Japanese Edo-period Ukiyo-e woodblock print (浮世絵 木版画). The overall feeling is a surreal collaboration between masters like Hokusai and Hiroshige, reimagining modern technology through an ancient lens. \\*\\*The Scene:\\*\\* 繁忙的涩谷十字路口 \\*\\*Edo Transformation Logic:\\*\\* Characters wear Edo-era kimono but perform modern actions. All technology is transformed into surreal Edo equivalents: \\* \\*\\*Smartphones\\*\\* are glowing, illustrated paper scrolls being read intently. \\* \\*\\*Metro stations/Trains\\*\\* are giant articulated wooden centipede carriages shuffling through crowds. \\* \\*\\*Skyscrapers\\*\\* are reimagined as endless, towering wooden pagodas reaching into dramatic clouds. \\* \\*\\*Robots/Mecha\\*\\* appear as giant, armored woodblock golems. The composition uses a flattened perspective with large, bold, hand-carved ink outlines (太い墨線). The background features heavily stylized Ukiyo-e wave patterns and dramatic, swirling clouds, with a distant Mt. Fuji visible on the horizon. The image must look like a physical print, not a digital painting. \\* \\*\\*Texture:\\*\\* Strong visible wood grain texture (木目) and rough paper fibers throughout the piece. \\* \\*\\*Printing Imperfections:\\*\\* Pigment bleeding is evident. Crucially, simulate hand-pressed plates with slight \\*\\*color misalignment (版ズレ)\\*\\* for authenticity. \\* \\*\\*Color Palette:\\*\\* Strictly limited to traditional mineral pigments. Dominant use of Prussian blue (浮世絵ブルー), vermilion red, and muted yellow ochre. \\* \\*\\*Lighting:\\*\\* Soft, flat, shadow-free lighting with no digital gradients. \\* \\*\\*Aspect Ratio:\\*\\* 3:4 vertical poster. \\* \\*\\*Extras:\\*\\* Include vertical Japanese calligraphy describing the scene and a traditional red artist seal stamp (落款) in a corner.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@Marky @ Easy-Peasy.AI](https://x.com/easy_peasy_ai \"@Marky @ Easy-Peasy.AI\")\n\nDec 3, 2025\n\n[\n\n### 2005 Sony CyberShot mall food court snapshot prompt\n\n](https://x.com/easy_peasy_ai/status/1996232508162310472)\n\n![2005 Sony CyberShot mall food court snapshot prompt - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909293283_f5655t_G7QK4bqbsAEzqlB-300x300.jpg)\n\n![2005 Sony CyberShot mall food court snapshot prompt - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909295848_nioupc_G7QK4b-acAA2_c9-300x300.jpg)\n\nAn image prompt that recreates an early-digital-camera mall food court photo with teens, harsh flash, date stamp, and Myspace-era aesthetics.\n\nPrompt\n\nA low-resolution digital photo taken on a 2005 Sony CyberShot. A group of teenagers hanging out in a mall food court. Harsh on-camera flash, slightly blown-out highlights, digital noise in the shadows. The skin texture looks slightly waxy due to early digital processing. Orange date stamp in the bottom right corner reading \"04/12/2005\". Candid, awkward angles, Myspace photo aesthetic.\n\nTry it now\n\nPromptOriginal\n\nBY[@𝗦𝗮𝗻𝗶𝗮](https://x.com/saniaspeaks_ \"@𝗦𝗮𝗻𝗶𝗮\")\n\n1 day ago\n\n[\n\n### Birthday Poster Collage with Neon Text\n\n](https://x.com/saniaspeaks_/status/2003103090778759237)\n\n![Birthday Poster Collage with Neon Text - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489497108_8cn8z7_G8xzgaHaQAAPd6z-300x402.jpg)\n\n![Birthday Poster Collage with Neon Text - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489497009_fp4w7c_G8xzdU9a0AAOt1t-300x402.jpg)\n\n![Birthday Poster Collage with Neon Text - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489497426_yr9xle_G8xzdapbUAAwDZ--300x402.jpg)\n\n![Birthday Poster Collage with Neon Text - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489499276_8wn07q_G8xzdayaEAA5sLX-300x402.jpg)\n\nA structured prompt for generating a stylish, cinematic poster collage celebrating a birthday, featuring a woman (with strict identity preservation from a reference image) against a tropical wall background with integrated neon lights and glowing 'it’s my birthday!' text.\n\nPrompt\n\n{ \"type\": \"image\\_generation\\_prompt\", \"style\": \"stylish poster collage, cinematic, trendy, lifestyle editorial\", \"identity\\_preservation\": { \"use\\_uploaded\\_image\": true, \"alter\\_face\": false, \"strict\\_identity\\_lock\": true, \"notes\": \"Keep the woman from the attached image as the main character. Preserve her facial features, proportions, and overall identity exactly as in the reference.\" }, \"subject\": { \"gender\": \"female\", \"role\": \"fashion model / main character\", \"pose\": { \"style\": \"confident or relaxed\", \"body\\_language\": \"natural, stylish, self-assured\" }, \"expression\": \"confident, calm, or subtly playful\", \"outfit\": { \"style\": \"modern, cool, fashionable\", \"notes\": \"Outfit should enhance a trendy, contemporary aesthetic suitable for a magazine or social media poster\" } }, \"environment\": { \"background\": { \"type\": \"tropical wall\", \"elements\": \\[ \"lush green leaves\", \"soft neon lights integrated into the foliage\" \\], \"color\\_palette\": \"vibrant greens with neon accents\" } }, \"graphics\": { \"neon\\_text\": { \"content\": \"it’s my birthday!\", \"style\": \"glowing neon typography\", \"colors\": \\[ \"warm orange\", \"pink\" \\], \"placement\": \"balanced within the composition, clearly visible but not overpowering the subject\" } }, \"lighting\": { \"type\": \"soft, warm, cinematic lighting\", \"effects\": \\[ \"gentle shadows\", \"warm highlights on skin and outfit\", \"neon glow interacting with the subject\" \\] }, \"composition\": { \"focus\": \"strong central subject\", \"layout\": \"poster-like collage\", \"emphasis\": \\[ \"atmosphere\", \"composition\", \"glow and mood\" \\] }, \"color\\_grading\": { \"style\": \"natural yet vibrant\", \"tone\": \"warm with trendy neon accents\" }, \"quality\": { \"realism\\_level\": \"stylized rather than fully realistic\", \"detail\\_level\": \"clean, polished, editorial-quality finish\" }, \"mood\": { \"atmosphere\": \"cinematic, trendy, celebratory\", \"vibe\": \"modern lifestyle, social-media-ready\" }, \"constraints\": \\[ \"Do not change the woman’s face or identity\", \"Avoid overly realistic rendering\", \"No watermarks or logos\" \\], \"output\\_goal\": \"Create a stylish, cinematic poster-style collage featuring a woman from the reference image against a tropical neon background, with glowing celebratory text and a modern, fashionable aesthetic.\" }\n\nTry it now\n\nPromptOriginal\n\nBY[@Indie Maker | AI](https://x.com/oslook_ \"@Indie Maker | AI\")\n\n1 day ago\n\n[\n\n### Infographic/Cover Design Style Template (LLM/Image)\n\n](https://x.com/oslook_/status/2003090197551177998)\n\n![Infographic/Cover Design Style Template (LLM/Image) - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489540045_9u5hln_G8xmNNOa8AAqcIE-300x164.jpg)\n\n![Infographic/Cover Design Style Template (LLM/Image) - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489540033_qeup4n_G8xmOoha8AAryJB-300x164.jpg)\n\nA simple template for generating infographics or cover designs using Nano Banana Pro, allowing the user to specify the desired style. Two example styles are provided: Retro/Vintage (using old fonts, textures, and tones, often combined with modern elements) and Hand-Drawn/Illustrative (friendly, warm, and personal, suitable for narrative content).\n\nPromptOriginal\n\nxxxxx, please generate an infographic, using the style 【xxxx】.\n\nTry it now\n\nPromptOriginal\n\nBY[@Lex](https://x.com/lexx_aura \"@Lex\")\n\n1 day ago\n\n[\n\n### Red Slip Dress Bathroom Selfie Prompt\n\n](https://x.com/lexx_aura/status/2003044060680892497)\n\n![Red Slip Dress Bathroom Selfie Prompt](https://cms-assets.youmind.com/media/1766489466566_lboypl_G8w98P6XAAAXlKO-300x402.jpg)\n\nPREVIEW\n\nA detailed image generation prompt structured for a hyperrealistic flash photograph of a young woman in a vibrant red satin slip dress, leaning against a marble bathroom vanity. The prompt specifies subject details, clothing, pose, environment (modern luxury bathroom with reflections), and lighting (direct flash photography) to achieve an influencer-style candid snapshot.\n\nPrompt\n\n{   \"prompt\\_structure\": {     \"subject\": {       \"description\": \"Young woman with light skin tone\",       \"hair\": \"Long, voluminous dark brunette hair, styled in loose waves, center part, reaching past shoulders\",       \"face\": \"Oval face shape, light-colored eyes (appearing green or grey), soft makeup with defined eyeliner and neutral glossy lips\",       \"expression\": \"Neutral, alluring gaze, direct eye contact with the camera\"     },     \"clothing\": {       \"type\": \"Slip dress / Chemise\",       \"color\": \"Vibrant red\",       \"material\": \"Satin or silk finish with a glossy sheen\",       \"details\": \"Spaghetti straps, V-neckline with scalloped lace trim, lace detailing near the hem, mini length\",       \"accessories\": \"Small silver pendant necklace, ring on ring finger of left hand\"     },     \"pose\": {       \"stance\": \"Leaning backward against a bathroom vanity counter\",       \"arms\": \"Arms extended downward, hands gripping or resting on the edge of the marble countertop\",       \"orientation\": \"Front-facing\"     },     \"environment\": {       \"setting\": \"Modern luxury bathroom\",       \"elements\": \\[         \"White marble countertop\",         \"Dark wood vanity cabinetry\",         \"Large wall mirror behind subject\",         \"Circular magnifying mirror on a gold/brass stand\",         \"Glass shower door/enclosure in background\"       \\],       \"reflections\": \"Subject's back and hair visible in the large mirror behind her\"     },     \"lighting\\_and\\_style\": {       \"lighting\": \"Direct flash photography, bright front illumination with slight shadows behind the subject\",       \"aesthetic\": \"Influencer lifestyle, candid snapshot, high-fidelity, 'night out' preparation vibe\",       \"color\\_palette\": \"Red, warm skin tones, cool whites and dark browns in background\"     }   } }\n\nTry it now\n\nPromptOriginal\n\nBY[@Lore](https://x.com/l_w_lorenzen \"@Lore\")\n\n1 day ago\n\n[\n\n### E-Girl Y2K Flash Selfie Prompt\n\n](https://x.com/l_w_lorenzen/status/2002997024996892830)\n\n![E-Girl Y2K Flash Selfie Prompt](https://cms-assets.youmind.com/media/1766489558942_eqiqvu_G8wTKYZbMAAifq_-300x300.jpg)\n\nPREVIEW\n\nA prompt for generating a high-angle, high-contrast selfie image with a Y2K grunge/E-girl aesthetic. It specifies the subject's silver-grey hair in pigtails, heavy eyeliner, a corset top, and a silver cross necklace, set in a dimly lit bedroom with purple LED accent lighting and harsh direct flash photography.\n\nPrompt\n\n{ \"image\\_generation\\_prompt\": { \"subject\": { \"demographics\": \"Young woman, fair skin, slim build\", \"hair\": { \"color\": \"{argument name=\\\\\"hair color\\\\\" default=\\\\\"Silver grey\\\\\"}\", \"style\": \"High pigtails, straight texture\", \"details\": \"Bangs framing the forehead and sides of the face\" }, \"face\\_and\\_makeup\": { \"eyes\": \"Green/hazel eyes, heavy winged eyeliner, long lashes\", \"expression\": \"Sultry gaze, slightly parted lips\", \"action\": \"Right index finger touching lower lip or corner of mouth\" } }, \"attire\": { \"clothing\": \"Sleeveless corset-style top with deep scoop neckline and visible hook-and-eye closures, partially visible skirt or shorts\", \"accessories\": \"Silver cross pendant necklace on a thin chain\" }, \"pose\": { \"type\": \"High-angle selfie\", \"body\\_position\": \"Arm extended toward camera, body angled slightly\" }, \"setting\": { \"location\": \"Bedroom interior\", \"background\\_elements\": \\[ \"Large white textured pillows (tufted or knit)\", \"White sheets\", \"Dark wall\" \\], \"ambient\\_lighting\": \"Purple LED strip light running horizontally behind the headboard\", \"atmosphere\": \"Dimly lit room with colored accent lighting\" }, \"style\\_and\\_technical\": { \"aesthetic\": \\[ \"E-girl\", \"Y2K grunge\", \"2000s digital aesthetic\" \\], \"lighting\\_technique\": \"Direct on-camera flash, harsh high-contrast lighting on subject against darker background\", \"camera\\_settings\": { \"angle\": \"High-angle wide selfie\", \"distortion\": \"Slight wide-angle distortion\", \"color\\_profile\": \"Full color, natural color rendering with vibrant neon purple accent\" }, \"aspect\\_ratio\": \"3:4\" } }\n\nTry it now\n\nPromptOriginal\n\nBY[@Lore](https://x.com/l_w_lorenzen \"@Lore\")\n\n1 day ago\n\n[\n\n### Platinum Blonde Bedroom Mirror Selfie Prompt (Detailed)\n\n](https://x.com/l_w_lorenzen/status/2002972442512519404)\n\n![Platinum Blonde Bedroom Mirror Selfie Prompt (Detailed)](https://cms-assets.youmind.com/media/1766489489320_rleskv_G8v8sbOacAARcjP-300x300.jpg)\n\nPREVIEW\n\nA highly detailed, structured prompt for generating a vertical mirror selfie of a platinum blonde woman in loungewear (ribbed tank and boy shorts) in a cozy bedroom setting, focusing on the 'classic high-angle mirror selfie pose' and specific details like phone accessories and lighting.\n\nPrompt\n\n{ \"subject\": { \"description\": \"Young woman taking bedroom mirror selfie, phone held high, casual loungewear moment\", \"age\": \"early 20s\", \"expression\": { \"eyes\": \"looking up at phone screen, soft doe eyes\", \"mouth\": \"soft pout, lips slightly pursed\", \"overall\": \"that 'checking my angles' focused selfie face\" }, \"hair\": { \"color\": \"platinum blonde, white-silver\", \"style\": \"messy high ponytail, loose and undone\", \"details\": \"lots of pieces falling out, face-framing strands, effortless messy\" }, \"body\": { \"frame\": \"petite, slim, toned\", \"waist\": \"small, defined, bare midriff\", \"stomach\": \"flat, toned, fully visible\", \"hips\": \"feminine curve\" }, \"pose\": { \"phone\\_arm\": \"raised HIGH above head, extended up\", \"other\\_arm\": \"down, hand resting on hip/thigh\", \"stance\": \"slight hip cock, weight shifted\", \"torso\": \"slight twist, elongated from raised arm\", \"overall\": \"the classic high-angle mirror selfie pose\" }, \"clothing\": { \"top\": { \"type\": \"Blake ribbed tank top\", \"fit\": \"fitted, cropped above belly button\", \"neckline\": \"scoop neck, simple\", \"effect\": \"basic but shows shape\" }, \"bottom\": { \"type\": \"White cotton boy shorts / mini shorts\", \"fit\": \"tight, very short, sits low on hips\", \"style\": \"lounge shorts, underwear-adjacent\", \"effect\": \"barely there, shows legs completely\" } }, \"accessories\": { \"phone\": \"iPhone with MagSafe ring, clear case\", \"hair\\_tie\": \"scrunchie in ponytail\", \"jewelry\": \"minimal, maybe small earrings\" } }, \"environment\": { \"location\": \"bedroom\", \"mirror\": \"full-length standing mirror\", \"room\\_details\": { \"bed\": \"visible in reflection, unmade, grey/beige bedding\", \"lamp\": \"warm bedside lamp glowing\", \"chair\": \"gaming/desk chair with clothes draped\", \"lights\": \"LED strip lights on wall\", \"clothes\": \"scattered on chair, lived-in\" }, \"lighting\": \"warm lamp light + LED strips, cozy evening\" }, \"photography\": { \"style\": \"mirror selfie, high angle\", \"framing\": \"thighs to above head\", \"angle\": \"phone above head shooting down\", \"quality\": \"iPhone\", \"aspect\": \"4:5 vertical\" }, \"color\\_story\": { \"her\": \"white tank, grey shorts, platinum hair\", \"room\": \"beige walls, grey bedding, warm lamp glow\", \"palette\": \"neutral, soft, cozy tones\" }, \"vibe\": { \"energy\": \"casual night in, loungewear content\", \"mood\": \"effortless, 'just hanging out'\", \"authenticity\": \"real bedroom, real mess, real girl\", \"caption\": \"'fit check' or 'staying in' or '🤍'\" } }\n\nTry it now\n\nPromptOriginal\n\nBY[@はろ | AI活用とHALO式スライド](https://x.com/haro_marketing \"@はろ | AI活用とHALO式スライド\")\n\n2 days ago\n\n[\n\n### Ballpoint Pen Drawing of Umaibo Comparison\n\n](https://x.com/haro_marketing/status/2002869182917124238)\n\n![Ballpoint Pen Drawing of Umaibo Comparison - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489555401_htpz7w_G8ue4NDbcAABPi1-300x164.jpg)\n\n![Ballpoint Pen Drawing of Umaibo Comparison - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489555187_5jvvtu_G8ue3sObsAA8eFK-300x450.jpg)\n\nThis tweet compares the output of Nano Banana Pro and GPT Image 1.5 using the same prompt to generate an image of the snack 'Umaibo' rendered in a ballpoint pen drawing style.\n\nPromptOriginal\n\nPlease generate an image of Umaibo drawn with a ballpoint pen.\n\nTry it now\n\n[![Geek-style ASCII character poster](https://cdn.gooo.ai/web-images/c9c0bb4f1c7b0554a21d97ed26ffc5a64e10d33c3d1b70526ef72f11ea9bdb0d@small)\n\nAI Shortcut\n\nInstall\n\n\n\n](https://youmind.com/shortcuts/9c9c2803-4297-419a-b5f3-f13b8fbdf5c5)\n\n[\n\n### Geek-style ASCII character poster\n\nTransform your ideas into stunning Swiss-ASCII posters. Generate mathematically precise, full-bleed designs with glowing ASCII objects and perfect grid alignment, all in seconds.\n\n\n\n](https://youmind.com/shortcuts/9c9c2803-4297-419a-b5f3-f13b8fbdf5c5)[Install on YouMind](https://youmind.com/shortcuts/9c9c2803-4297-419a-b5f3-f13b8fbdf5c5)\n\nPromptOriginal\n\nBY[@KeorUnreal](https://x.com/KeorUnreal \"@KeorUnreal\")\n\n2 days ago\n\n[\n\n### Gold Symbiote Mirror Selfie Prompt\n\n](https://x.com/KeorUnreal/status/2002854337475678587)\n\n![Gold Symbiote Mirror Selfie Prompt](https://cms-assets.youmind.com/media/1766489557239_jx2f4f_G8uRZojWQAAtsno-300x537.jpg)\n\nPREVIEW\n\nA detailed JSON prompt for Nano Banana Pro to generate a photorealistic, high-quality mirror selfie of a woman wearing a form-fitting gold symbiote-inspired superhero bodysuit in a dimly lit luxury bathroom, emphasizing a lo-fi social media aesthetic and specific makeup details.\n\nPrompt\n\n{ \"shot\": \"A tight close-up mirror selfie\", \"subject\": { \"appearance\": \"a stunning woman\", \"hair\": \"short hair\", \"pose\": \"sitting casually sideways on a white bathroom vanity counter\", \"gaze\": \"looking at the mirror\" }, \"outfit\": { \"bodysuit\": \"form-fitting gold symbiote-inspired superhero bodysuit with subtle dark web texturing\", \"emblem\": \"prominent white spider emblem on the chest\" }, \"phone\": { \"device\": \"red smartphone\", \"case\": \"white spider logo case\", \"action\": \"holding it up to capture the reflection\" }, \"environment\": { \"location\": \"luxury bathroom\", \"lighting\": \"dimly lit with warm, soft indoor lighting\", \"atmosphere\": \"intimate atmosphere with soft shadows\", \"visible\\_elements\": \"only a partial section of the white sink basin and counter surface visible at the bottom of the frame\", \"mirror\": \"mirror edges are cropped out of view\" }, \"aesthetic\": \"high quality, photorealistic, lo-fi social media aesthetic\", \"makeup\": { \"blush\": \"prominent soft pink blush on her cheeks\", \"finish\": \"glowy makeup\", \"highlighter\": \"on the tip of her nose\", \"lips\": \"slightly parted soft warm pink lips\" }, \"skin\": \"highly detailed skin texture\" \"lighting\\_detail\": \"even, invisible front illumination that softly brightens the face with neutral white light, no visible light source, no shadows, no reflections, no hotspots\", \"quality\": \"no blur\" }\n\nTry it now\n\nPromptOriginal\n\nBY[@てんねん](https://x.com/munou_ac \"@てんねん\")\n\n2 days ago\n\n[\n\n### Nano Banana Pro X Header Image Generation Prompt\n\n](https://x.com/munou_ac/status/2002850192207597760)\n\n![Nano Banana Pro X Header Image Generation Prompt - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489525059_2o3mqx_G8uNoWzaAAA1VwE-300x99.jpg)\n\n![Nano Banana Pro X Header Image Generation Prompt - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489525611_5q0gkx_G8uNocrboAAp-oB-300x99.jpg)\n\n![Nano Banana Pro X Header Image Generation Prompt - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489525731_bqh21d_G8uNoWyaoAAOvlV-300x99.jpg)\n\n![Nano Banana Pro X Header Image Generation Prompt - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489526547_e79955_G8uNoWzbIAAN3N7-300x99.jpg)\n\nThis is a detailed prompt designed for Nano Banana Pro to generate an X (Twitter) header image based on a reference image. It includes a custom logo design based on user-specified text and a style preset, and offers options for face zooming to control the composition within a defined safe zone. It's an updated version of a previous prompt, focusing on practicality for profile image creation.\n\nPromptOriginal\n\n\\# ===== USER CONTROLS ===== title\\_text: \"<<YOUR\\_TEXT>>\" title\\_style\\_preset: \"cool\" # cool, cute, cool\\_cute, luxury, pop, cyber, minimal, retro, kawaii face\\_zoom: \"off\" # off, on subject: > Create a 3:1 wide banner using the provided reference image content. The primary face must be centered inside an invisible safe zone (not drawn), and a title logo (derived from title\\_text + title\\_style\\_preset) must be placed inside the same safe zone. composition: > Aspect ratio 3:1. Invisible safe zone (DO NOT draw it): - Left margin: 15% of width - Right margin: 15% of width - Top margin: 16% of height - Bottom margin: 16% of height Keep the entire face AND the entire title logo fully inside this safe zone. Background may extend to the edges. action: > Place the reference image content with maximum fidelity. Auto-crop/scale/reposition to fit a 3:1 banner with no stretching. Detect the primary face (if multiple faces, pick the largest/most prominent). Center the primary face within the safe zone both horizontally and vertically. Never crop off the face/eyes; keep the full face comfortably inside the safe zone (not near edges). Face zoom behavior: - If face\\_zoom is OFF: keep the original framing as much as possible while still centering the face in the safe zone. - If face\\_zoom is ON: zoom/crop to a bust-up portrait centered on the face (head and shoulders visible; include upper chest; do not crop the top of the head or chin; keep facial features prominent). Create negative space inside the safe zone for the title logo by adjusting crop/reposition/out\n\nTry it now\n\nPromptOriginal\n\nBY[@Sienna](https://x.com/siennalovesai \"@Sienna\")\n\n2 days ago\n\n[\n\n### Baby Blue Polka Dot Top Bathroom Selfie Prompt\n\n](https://x.com/siennalovesai/status/2002845777840706047)\n\n![Baby Blue Polka Dot Top Bathroom Selfie Prompt](https://cms-assets.youmind.com/media/1766489561160_i6m9fm_G8uJnTPXsAAffsp-300x372.jpg)\n\nPREVIEW\n\nA prompt for generating a glamorous, flirtatious fashion snapshot. The subject has platinum blonde hair in a sleek high ponytail, wearing a baby blue polka-dot strapless top and low-rise white jeans, posing in a luxurious marble bathroom with a teasing gaze.\n\nPrompt\n\n{ \"aspect\\_ratio\": \"4:5\", \"scene\\_type\": \"indoor fashion snapshot\", \"environment\": { \"location\": \"luxurious bathroom\", \"background\": { \"wall\": \"marble wall\", \"mirror\": \"large mirror edge visible\" } }, \"subject\": { \"hair\": { \"color\": \"platinum blonde\", \"length\": \"long\", \"style\": \"high sleek ponytail\" }, \"wardrobe\": { \"top\": { \"item\": \"strapless fitted top\", \"color\": \"{argument name=\\\\\"top color\\\\\" default=\\\\\"baby blue\\\\\"}\", \"pattern\": \"small black polka dots\" }, \"bottom\": { \"item\": \"low-rise white denim jeans\" } }, \"accessories\": { \"bag\": { \"type\": \"small silver shoulder bag\" }, \"nails\": { \"color\": \"soft blue\" } }, \"pose\": { \"hand near mouth, direct teasing gaze\" } }, \"mood\": { \"vibe\": \"confident, glamorous, flirtatious\" } }\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@セミナー講師専門AIコンシェルジュ｜工藤 晶](https://x.com/akirakudo_ai \"@セミナー講師専門AIコンシェルジュ｜工藤 晶\")\n\nNov 22, 2025\n\n[\n\n### Hand-drawn style header image prompt from photo\n\n](https://x.com/akirakudo_ai/status/1992096860765561190)\n\n![Hand-drawn style header image prompt from photo - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885651870_4szbai_G6VZiROagAAqsIh-300x168.jpg)\n\n![Hand-drawn style header image prompt from photo - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885654537_qf6h9o_G6VZiRWaIAA_9x5-300x380.jpg)\n\nPrompt for a hand-drawn style header image of a person introducing Nano Banana Pro\n\nPromptOriginal\n\nCompletely recreate the uploaded person. Make it a header image for a note article where that person introduces “Nano Banana Pro”. Aspect ratio: horizontal 16:9. Style and colors: simple, hand-drawn style, italic, with a blue and green gradient. Title text: “In-depth explanation of Google’s new AI ‘Nano Banana Pro’”.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@ひでもん | AI開発@ニュース発信](https://x.com/okknews \"@ひでもん | AI開発@ニュース発信\")\n\nNov 22, 2025\n\n[\n\n### Chalkboard-style AI news summary\n\n](https://x.com/okknews/status/1992173611520868372)\n\n![Chalkboard-style AI news summary - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885620059_vzaj75_G6WfVvIbAAEgvYg-300x300.jpg)\n\n![Chalkboard-style AI news summary - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885622901_pk1vka_G6P2CkracAINIfP-300x300.jpg)\n\nA Japanese prompt for turning AI news content into a hand-drawn, teacher-style chalkboard diagram with explanations.\n\nPromptOriginal\n\nUsing the following content, summarize the news in a chalkboard-style, hand‑written look, and break it down with diagrams and easy‑to‑understand expressions as if a teacher had written it. —- Search results from Grok\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@KAWAI](https://x.com/kawai_design \"@KAWAI\")\n\nNov 22, 2025\n\n[\n\n### Train-ad style book advertisement image\n\n](https://x.com/kawai_design/status/1992142466255114727)\n\n![Train-ad style book advertisement image](https://cms-assets.youmind.com/media/1763885539326_yao7in_G6WBYReawAAcp2x-300x168.jpg)\n\nPREVIEW\n\nA detailed Japanese prompt for generating a 16:9 business-book-style advertisement featuring a specific book image with Japanese copy points.\n\nPromptOriginal\n\nPlease generate an advertisement image. ==== Ad specifications === - Aspect ratio: 16:9 (horizontal) - Product to advertise: the book in the first attached image - Main eye-catcher: place the book from the first attached image in a three-dimensional way - Language: Japanese - Taste: advertisement for a business book # Text to include: - Pre-head copy: 【New print run decided about one week after release】 Book “Designing from Zero with AI” now on sale and doing well. Amazon Best Seller Ranking Ranked No.1 in commercial design sales (as of 10/15) https://t.co/QxbYpfFVj6\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@VoxcatAI](https://x.com/VoxcatAI \"@VoxcatAI\")\n\nDec 3, 2025\n\n[\n\n### Luxury minimalist product photography based on a reference image\n\n](https://x.com/VoxcatAI/status/1996273073725780161)\n\n![Luxury minimalist product photography based on a reference image](https://cms-assets.youmind.com/media/1764915823213_skhwpb_G7Qvxi5bIAAqpfX-300x372.jpg)\n\nPREVIEW\n\nA prompt for generating high-end, minimalist commercial product photography in the style of luxury brand ads, using an uploaded reference image of the core product as the base.\n\nPromptOriginal\n\nUsing my uploaded reference image as the base, generate a minimalist, high-quality commercial still life photograph with the aesthetic of a luxury brand advertisement. Preserve the general shape, proportions, and main color scheme of the core product in the reference so that it is instantly recognizable as the same product, but upgrade the overall texture and atmosphere of the image, making it look like an ad for a top-tier international fragrance, skincare item, or high-end electronic product. Use a vertical 4:5 composition. The background should be a large area of clean, neutral negative space, such as soft off-white, cool gray, or light beige, creating a quiet, restrained, and expensive studio environment. Apart from the core product and a minimal number of necessary supports, do not add any extra decorations. No clutter, no elaborate scene setup—only keep very simple geometric supports (such as a plain white cube, a cylinder, or a thin transparent panel). The supports must be simple and low-profile, existing only to hold and accentuate the product. Strongly emphasize the material details of the product, and let the lighting fully serve those materials: Show frosted glass with a fine, soft matte texture, ceramics with a matte or slightly glazed feel, and polished metal with clean, sharp specular highlights. Liquids should have clearly visible viscosity and volume. Avoid any cheap plastic feel, complex patterns, or gaudy stickers; the overall material quality must feel cool, restrained, and luxurious. Use professional studio lighting: mainly soft, diffused light from softboxes, plus precise rim light outlining the product’s shape. The contours should be crisp and layered, and the shadows should be soft and clean, with no noise or dirty shadow patches. You may use a near-macro viewpoint, moving in closer to the product to highlight materials and details, while preserving ample negative space around the frame so the product can \"speak for itself\" in the emptiness. Keep the overall color scheme neutral and calm. The product’s own color can be slightly more saturated, making it the single visual focal point in the scene. Do not use exaggerated gradient backgrounds, flashy colored lighting, or e-commerce promo aesthetics. No large-price text, labels, or cartoon graphics. The final result must be a high-resolution commercial key visual that looks ready for a magazine back cover or a high-end brand announcement poster: minimalist, quiet, high-end, with the core product confidently centered, surrounded by clean negative space and precisely controlled lighting.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@松果先森](https://x.com/songguoxiansen \"@松果先森\")\n\nNov 21, 2025\n\n[\n\n### Dream diary with Kirby blowing bubbles\n\n](https://x.com/songguoxiansen/status/1991795708308189668)\n\n![Dream diary with Kirby blowing bubbles](https://cms-assets.youmind.com/media/1763886710060_ndpy3q_G6RHoGna4AArBDN-300x164.jpg)\n\nPREVIEW\n\nA cute prompt for a dreamy diary-style illustration of a pink Kirby sleeping on a star, blowing rainbow bubbles amid pastel clouds and candy.\n\nPromptOriginal\n\nDream diary. A pink Kirby lying asleep on a star, blowing rainbow-colored bubbles from its mouth. Soft macaron color palette, cloud and candy stickers, glittery crayon-like details, dreamy and sweet.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@宝玉](https://x.com/dotey \"@宝玉\")\n\nOct 9, 2025\n\n[\n\n### Detailed mirror-selfie otaku room scene\n\n](https://x.com/dotey/status/1976485558319722711)\n\n![Detailed mirror-selfie otaku room scene](https://cms-assets.youmind.com/media/1763889946850_689z0h_G23i3sJW0AASGUw-300x300.jpg)\n\nPREVIEW\n\nA very detailed Nano Banana prompt describing a female mirror selfie in a blue-toned otaku computer corner, with full specifications for character, environment, lighting, camera, and negative prompts.\n\nPromptOriginal\n\n\\### Scene Mirror selfie in an otaku-style computer corner, blue color tone. ### Subject \\* Gender expression: female \\* Age: around 25 \\* Ethnicity: East Asian \\* Body type: slim, with a defined waist; natural body proportions \\* Skin tone: light neutral tone \\* Hairstyle: \\* Length: waist-length hair \\* Style: straight with slightly curled ends \\* Color: medium brown \\* Pose: \\* Stance: standing in a slight contrapposto pose \\* Right hand: holding a smartphone in front of her face (identity hidden) \\* Left arm: naturally hanging down alongside the torso \\* Torso: body leaning slightly back; waist and abdomen exposed \\* Clothing: \\* Top: light blue cropped knit cardigan, top two buttons fastened; a blue French-style bra faintly visible \\* Bottom: denim ultra-short shorts, with a blue satin ribbon bow on each side of the hips \\* Socks: blue and white horizontal striped over-the-knee socks \\* Accessory: a blue cute mascot phone case ### Environment \\* Description: bedroom computer corner seen through a wall-mounted mirror \\* Furnishings: \\* White desk \\* Single monitor showing a soft blue wallpaper (no readable text) \\* Mechanical keyboard with white keycaps on a blue desk mat \\* Mouse on a small blue mouse pad \\* PC tower on the right side with blue case lighting \\* Three anime figures on or near the PC tower \\* A poster of a pagoda on the wall \\* Cat-shaped desk lamp with blue accents \\* A transparent glass of water \\* A tall green leafy plant by the window (on the left side of the frame) \\* Color replacement: replace all originally pink elements (clothes and room decor) with blue tones (baby blue to sky blue/periwinkle blue). ### Lighting \\* Light source: daylight coming from a large window on the left side of the camera, through sheer curtains \\* Light quality: soft, diffused light \\* White balance (K): 5200 ### Camera \\* Mode: smartphone rear camera shooting via the mirror (no portrait/bokeh mode) \\* Equivalent focal length (mm): 26 \\* Distances (m): \\* Subject to mirror: 0.6 \\* Camera to mirror: 0.5 \\* Exposure: \\* Aperture (f): 1.8 \\* ISO: 100 \\* Shutter speed (s): 0.01 \\* Exposure compensation (EV): -0.3 \\* Focus: focus on the torso and shorts in the mirror image \\* Depth of field: natural smartphone deep depth of field; background clearly visible with no artificial blur \\* Composition: \\* Aspect ratio: 1:1 \\* Crop: from the top of the head to mid-thigh; include the desk, monitor, PC tower, and plant in the frame \\* Angle: slightly high angle from the mirror’s point of view \\* Composition note: keep the subject centered; to avoid wide-angle edge distortion, have her stand a bit further away and crop to a square later. ### Negative prompts \\* Any appearance of pink/magenta anywhere \\* Beauty filters/over-smoothed skin; poreless skin look \\* Exaggerated or distorted anatomy \\* NSFW, see-through fabrics, wardrobe malfunctions \\* Logos, brand names, or readable user interface text \\* Fake portrait-mode blur, CGI/illustration feel\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@K](https://x.com/ChillaiKalan__ \"@K\")\n\nNov 23, 2025\n\n[\n\n### Black and white studio side-profile portrait prompt\n\n](https://x.com/ChillaiKalan__/status/1992790080503902651)\n\n![Black and white studio side-profile portrait prompt](https://cms-assets.youmind.com/media/1764909188004_owsg5r_G6fQALWbMAAa0C--300x224.jpg)\n\nPREVIEW\n\nA concise Nano Banana Pro prompt for a hyper-realistic black and white studio portrait of a young man in side profile, using an attached reference image and specifying size and output count.\n\nPrompt\n\n{ \"Use the attached image of the person as reference. Hyper-realistic black and white studio portrait of the young man in side profile, natural hair gently falling around his face. Strong rim light accentuating his jawline and nose, dark minimalist background. Expression thoughtful and serene, cinematic lighting creating dramatic contrast and fine photographic detail.\", \"size\": \"1024x1024\", \"n\": 1 }\n\nTry it now\n\nPromptOriginal\n\nBY[@ttmouse - 豆爸](https://x.com/ttmouse \"@ttmouse - 豆爸\")\n\n1 day ago\n\n[\n\n### Nano Banana Pro Community Prompt Concepts Summary\n\n](https://x.com/ttmouse/status/2003112308319375843)\n\n![Nano Banana Pro Community Prompt Concepts Summary](https://cms-assets.youmind.com/media/1766489559958_58r1mn_G8x8AJIX0AAX7ny-300x623.jpg)\n\nPREVIEW\n\nThis tweet summarizes popular creative concepts and prompt types trending in the Nano Banana Pro community, including generating giant surreal monuments (like pencils), high-end functional drink concepts, rubber hose 3D cartoon characters, and dystopian book dioramas. It does not contain a single executable prompt but lists several high-level ideas.\n\nPromptOriginal\n\nPrompt for generating giant surreal monuments from everyday objects, such as pencils, creating surreal city sculpture scenes. Prompt for a high-end functional beverage concept from a non-beverage brand, sharing detailed cosmic high-aesthetics prompts. Prompt for rubber hose 3D style cartoon characters, generating a series of cute dynamic poses. Universal 3x3 grid advertising prompt perfectly achieving product consistency in Nano Banana Pro. Dreamy prompt for augmented reality Spotify play cards surrounding a person, generating sci-fi dynamic effects. Prompt for generating personalized sticker packs from uploaded photos, featuring cute designs in various clothing styles. Creative prompt for dystopian novel-themed miniature worlds inside open books, presented in a diptych format. Prompt for polymer clay style celebrity miniature dolls, generating cute, handcrafted-looking portraits. Prompt for generating Bollywood star social brand studio portraits from uploaded photos. Prompt for realistic 3D rendering scenes of fictional Arrow Dynamics equipment, visualizing high-end product concepts. Prompt for frozen tundra themed human scenes, generating a blend of cold-toned, magnificent nature. Prompt for giant cosmic hourglass mysterious scenes, directly outputting surreal cinematic works. Prompt for ancient Egyptian Eye of Horus stone wall with mysterious golden light, directly outputting classic mystical style. Simple prompt for generating a horror video effect where facial skin opens to reveal internal machinery. Prompt for Bollywood poster style Indian actress in a blue sari, creating elegant and dreamy compositions. Prompt for Knolling flat lay photography of popular items from one's birth year.\n\nTry it now\n\nPromptOriginal\n\nBY[@松果先森](https://x.com/songguoxiansen \"@松果先森\")\n\n1 day ago\n\n[\n\n### Christmas Skincare Set Promotion Card\n\n](https://x.com/songguoxiansen/status/2003096613359853946)\n\n![Christmas Skincare Set Promotion Card](https://cms-assets.youmind.com/media/1766489525155_o9dyiz_G8xts6caYAAP660-300x537.jpg)\n\nPREVIEW\n\nA Nano banana pro prompt designed to generate a promotional card for a Christmas skincare product set. The card features a festive, warm, and luxurious aesthetic with a focus on the product packaging and a clear call to action.\n\nPromptOriginal\n\nChristmas skincare product set promotion card, warm tones, festive atmosphere, luxurious, highlighting product packaging, including promotion information, and a CTA button. Christmas Skincare Set, Limited Time Discount, Shop Now, 8k, ultra clear, cinematic, soft lighting, depth of field, product photography, exquisite, detailed, high quality\n\nTry it now\n\n[![TEDStylePPT](https://cdn.gooo.ai/gen-images/b3d627602514869a171e7e70dc6ade6f6b0cc2fa5753f34b6d2c31c0822d18d1.png@small)\n\nAI Shortcut\n\nInstall\n\n\n\n](https://youmind.com/shortcuts/61d89b76-3842-4a12-89c7-b54e3d66ab7c)\n\n[\n\n### TEDStylePPT\n\nTransform your ideas into captivating TED-style presentations. Craft compelling narratives and stunning visuals that inspire and engage, all with the click of a button.\n\n\n\n](https://youmind.com/shortcuts/61d89b76-3842-4a12-89c7-b54e3d66ab7c)[Install on YouMind](https://youmind.com/shortcuts/61d89b76-3842-4a12-89c7-b54e3d66ab7c)\n\nPromptOriginal\n\nBY[@Adam也叫吉米](https://x.com/Adam38363368936 \"@Adam也叫吉米\")\n\n1 day ago\n\n[\n\n### Christmas Box Challenge Photo Collage Prompt\n\n](https://x.com/Adam38363368936/status/2003025725675204789)\n\n![Christmas Box Challenge Photo Collage Prompt](https://cms-assets.youmind.com/media/1766489532891_40vkn5_G8wsmbracAEoQKc-300x504.jpg)\n\nPREVIEW\n\nA highly specific prompt for Nano Banana Pro to generate an ultra-realistic, high-quality 2x2 creative photo collage of a young woman posing inside cardboard boxes for a Christmas-themed challenge. The prompt emphasizes panel layout and interaction, specifically requiring a continuous action (red wine pouring) across the two right-hand panels, while maintaining the subject's face without change.\n\nPrompt\n\nUse the face without any change.A high-quality 2x2 creative photo collage of a young woman with long wavy black hair , posing inside cardboard boxes for a Christmas-themed challenge. She wears a cream, red, and green Fair Isle knit sweater. Layout & Interaction (Crucial):The right side features a continuous action across two panels. Red wine is poured from the top-right panel and flows vertically down into the bottom-right panel. Panel Details: Top Left: She blows artificial snow from her palms towards the camera. Bottom Left: She holds glowing fairy lights and a red bauble, smiling warmly. Top Right: She leans on the box edge, holding a wine bottle, pouring red wine downwards so the liquid stream exits the bottom of this frame. Bottom Right: She is positioned below, holding a wine glass that catches the stream of wine pouring down from the panel above. She is looking up, watching the wine flow into her glass. Style: Creative box challenge photography, seamless cross-panel interaction, festive mood, soft studio lighting, ultra-realistic textures.\n\nTry it now\n\nPromptOriginal\n\nBY[@Melisa♡](https://x.com/xmliisu \"@Melisa♡\")\n\n1 day ago\n\n[\n\n### 3x3 Collage of Beauty Product Flat Lays and Portraits\n\n](https://x.com/xmliisu/status/2002983283429146835)\n\n![3x3 Collage of Beauty Product Flat Lays and Portraits](https://cms-assets.youmind.com/media/1766489486966_b2hn59_G8wGrKjXsAAgrAb-300x537.jpg)\n\nPREVIEW\n\nA highly detailed, structured prompt for generating a 3x3 grid collage featuring a young woman with vibrant red hair, wearing a maroon corset dress, showcasing gold dangle earrings, cosmetics, and various poses/reflections in a luxury interior setting.\n\nPrompt\n\n{ \"image\\_composition\": { \"type\": \"Collage\", \"layout\": \"3x3 Grid\", \"total\\_panels\": 9 }, \"subject\\_details\": { \"appearance\": \"Young woman with fair skin\", \"hair\": { \"color\": \"Vibrant red\", \"style\": \"Loose waves, shoulder-length, side-parted\", \"texture\": \"Silky and voluminous\" }, \"eyes\": \"Blue/Green\", \"expression\": \"Varied (serious, smiling, laughing, focused)\" }, \"fashion\\_and\\_style\": { \"outfit\": { \"garment\": \"Strapless corset-style dress or top\", \"color\": \"Deep maroon / Berry\", \"fabric\": \"Satin or Silk\", \"details\": \"Ruched bodice, structural boning visible\" }, \"makeup\": { \"style\": \"Natural glam\", \"features\": \"Glowing skin, soft blush, defined lashes, nude/pink glossy lips\" } }, \"jewelry\\_focus\": { \"item\\_type\": \"Dangle Earrings\", \"metal\": \"Gold\", \"design\\_elements\": \\[ \"Huggie hoop base\", \"Large sunburst/starburst main charm\", \"Pave set crystals\", \"Delicate hanging chains\", \"Small star charms at ends of chains\" \\] }, \"setting\\_and\\_environment\": { \"location\": \"Luxury interior (likely a hotel suite or upscale bathroom)\", \"key\\_features\": \\[ \"Large rectangular mirror with integrated LED lighting border\", \"White marble countertops\", \"Wood paneling on walls\", \"Large floor-to-ceiling windows\", \"Beige curtains\" \\], \"lighting\": \"Mix of natural daylight and warm artificial vanity lighting\" }, \"props\\_and\\_objects\": { \"cosmetics\": \\[ \"Lip gloss tube\", \"Mascara/Eyeliner tube\", \"Glass perfume bottle with gold cap\", \"Round compact powder\" \\], \"tech\": \"Black smartphone\", \"background\\_props\": \"Beige silk/satin fabric cloth (in flat lay)\" }, \"panel\\_breakdown\": { \"top\\_row\": \\[ \"Reflection in lit mirror applying makeup\", \"Flat lay of jewelry and cosmetics on marble\", \"Close-up putting on earring near window\" \\], \"middle\\_row\": \\[ \"Extreme close-up of earring on ear\", \"Side profile focusing on hair texture and shoulder\", \"Waist-up portrait facing forward near window\" \\], \"bottom\\_row\": \\[ \"Portrait touching hair looking away\", \"Reflection in mirror laughing/smiling\", \"Flat lay of earrings on folded beige silk cloth\" \\] } }\n\nTry it now\n\nPromptOriginal\n\nBY[@Melisa♡](https://x.com/xmliisu \"@Melisa♡\")\n\n1 day ago\n\n[\n\n### E-girl Y2K Grunge Selfie Prompt\n\n](https://x.com/xmliisu/status/2002937136815993283)\n\n![E-girl Y2K Grunge Selfie Prompt - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489516575_0fzbgz_G8uGICQXQAIK0d9-300x402.jpg)\n\n![E-girl Y2K Grunge Selfie Prompt - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489516821_8c79ab_G8uGICLXwAA_kM1-300x402.jpg)\n\nA structured prompt designed to generate an 'E-girl' style, high-angle mirror selfie with a Y2K grunge aesthetic. It specifies silver-grey hair in pigtails, heavy makeup, a corset top, and a dimly lit bedroom setting with purple LED accent lighting and harsh direct flash.\n\nPrompt\n\n{ \"image\\_generation\\_prompt\": { \"subject\": { \"demographics\": \"Young woman, fair skin, slim build\", \"hair\": { \"color\": \"Silver grey\", \"style\": \"High pigtails, straight texture\", \"details\": \"Bangs framing the forehead and sides of the face\" }, \"face\\_and\\_makeup\": { \"eyes\": \"Green/hazel eyes, heavy winged eyeliner, long lashes\", \"expression\": \"Sultry gaze, slightly parted lips\", \"action\": \"Right index finger touching lower lip or corner of mouth\" } }, \"attire\": { \"clothing\": \"Sleeveless corset-style top with deep scoop neckline and visible hook-and-eye closures, partially visible skirt or shorts\", \"accessories\": \"Silver cross pendant necklace on a thin chain\" }, \"pose\": { \"type\": \"High-angle selfie\", \"body\\_position\": \"Arm extended toward camera, body angled slightly\" }, \"setting\": { \"location\": \"Bedroom interior\", \"background\\_elements\": \\[ \"Large white textured pillows (tufted or knit)\", \"White sheets\", \"Dark wall\" \\], \"ambient\\_lighting\": \"Purple LED strip light running horizontally behind the headboard\", \"atmosphere\": \"Dimly lit room with colored accent lighting\" }, \"style\\_and\\_technical\": { \"aesthetic\": \\[ \"E-girl\", \"Y2K grunge\", \"2000s digital aesthetic\" \\], \"lighting\\_technique\": \"Direct on-camera flash, harsh high-contrast lighting on subject against darker background\", \"camera\\_settings\": { \"angle\": \"High-angle wide selfie\", \"distortion\": \"Slight wide-angle distortion\", \"color\\_profile\": \"Full color, natural color rendering with vibrant neon purple accent\" }, \"aspect\\_ratio\": \"3:4\" } } }\n\nTry it now\n\nPromptOriginal\n\nBY[@けこねこ](https://x.com/soranoblue3 \"@けこねこ\")\n\n2 days ago\n\n[\n\n### Star Present for an Angel Girl\n\n](https://x.com/soranoblue3/status/2002865913520173097)\n\n![Star Present for an Angel Girl](https://cms-assets.youmind.com/media/1766489542280_kxkawu_G8ub7d_aIAAa9tP-300x402.jpg)\n\nPREVIEW\n\nA prompt used with Nano Banana Pro to generate an image of a star present for an angel girl, likely used for a holiday greeting or seasonal content.\n\nPromptOriginal\n\nA slightly early star present for you from yesterday's angel girl~.｡.:\\*☆\n\nTry it now\n\nPromptOriginal\n\nBY[@Sienna](https://x.com/siennalovesai \"@Sienna\")\n\n2 days ago\n\n[\n\n### Gym Pose Portrait with Reference Image Adherence\n\n](https://x.com/siennalovesai/status/2002861078888272203)\n\n![Gym Pose Portrait with Reference Image Adherence](https://cms-assets.youmind.com/media/1766489504497_9qkfhz_G8uXiCBXsAAoSzJ-300x537.jpg)\n\nPREVIEW\n\nA structured JSON prompt for generating a medium-full shot portrait of a fit woman posing in a gym, specifically looking back over her shoulder. Crucially, the prompt includes explicit instructions for strict adherence to an uploaded reference image for facial features and body proportions.\n\nPrompt\n\n{ \"image\\_generation\\_request\": { \"parameters\": { \"aspect\\_ratio\": \"9:16\", \"model\\_version\": \"v6.0\", \"stylize\": 250, \"quality\": \"high\" }, \"reference\\_settings\": { \"use\\_reference\\_image\": true, \"consistency\\_weight\": 1.0, \"instruction\": \"Strict adherence to uploaded reference image. Maintain exact facial features and body proportions with 0% deviation.\" }, \"prompt\\_structure\": { \"subject\": { \"demographics\": { \"gender\": \"Female\", \"physique\": \"Fit, toned\", \"hair\\_style\": \"Long straight black hair\" }, \"apparel\": { \"upper\\_body\": { \"item\": \"Tank top\", \"color\": \"Pink\", \"fit\": \"Athletic/Tight\" }, \"lower\\_body\": { \"item\": \"Athletic shorts\", \"color\": \"Gray\", \"texture\": \"Soft fabric\", \"fit\": \"Form-fitting/Highlighting physique\" } }, \"pose\\_and\\_expression\": { \"body\\_orientation\": \"Looking back over shoulder\", \"facial\\_expression\": \"Slight smile\", \"action\": \"Standing/Posing\" } }, \"environment\": { \"setting\\_type\": \"Indoor Gym\", \"architectural\\_details\": { \"wall\\_color\": \"White\", \"accents\": \"Blue\", \"flooring\": \"Standard gym flooring\" }, \"props\\_and\\_equipment\": \\[ \"Various exercise machines\", \"Gym equipment in background\" \\], \"lighting\": { \"source\": \"Overhead\", \"quality\": \"Artificial, bright\" } }, \"composition\": { \"camera\\_angle\": \"Eye level\", \"framing\": \"Medium-full shot\", \"focus\": \"Sharp focus on subject\" } } } }\n\nTry it now\n\nPromptOriginal\n\nBY[@セレナ](https://x.com/serena_ailab \"@セレナ\")\n\n2 days ago\n\n[\n\n### Nostalgic Japanese Flip Phone (Garakei) Display Generator\n\n](https://x.com/serena_ailab/status/2002854097494687964)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489550601_gq9cgn_G8uNwLBakAA1I5a-300x537.jpg)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489551094_rsidua_G8uNwLEa4AARSjR-300x537.jpg)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489552510_mt7jit_G8uNwK8a0AAApyl-300x537.jpg)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489551136_8bniot_G8uNwLEaMAAXX9v-300x300.jpg)\n\nThis prompt uses Nano Banana Pro to embed an uploaded image onto the small LCD screen of an early 2000s Japanese flip phone (garakei). The scene is styled with nostalgic elements like pixelated edges, pastel beaded straps, photo stickers, and gel pens, evoking a 'kawaii' and emotional retro aesthetic.\n\nPrompt\n\nDisplay the subject from the attached image on a flip phone (garakei) LCD screen from early 2000s Japan. The phone is open, with glossy pink or white shell, physical buttons, and simple beaded straps with pastel colored beads. The screen shows the image with pixelated edges and warm color saturation typical of 2000s mobile displays. Surrounded by nostalgic items like photo stickers, gel pens, and mini notebooks. Nostalgic, kawaii, emotional, soft lighting.\n\nTry it now\n\nPromptOriginal\n\nBY[@ANKIT PATEL 🇮🇳 | AI](https://x.com/Ankit_patel211 \"@ANKIT PATEL 🇮🇳 | AI\")\n\n2 days ago\n\n[\n\n### Hyper-Realistic 3D Architectural Exhibition Booth Visualization\n\n](https://x.com/Ankit_patel211/status/2002846579137577429)\n\n![Hyper-Realistic 3D Architectural Exhibition Booth Visualization - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489504133_fx2tzq_G8uKWVwbsAA400C-300x300.jpg)\n\n![Hyper-Realistic 3D Architectural Exhibition Booth Visualization - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489504696_5ekkfa_G8uKWWWbIAAHs7J-300x300.jpg)\n\nA template prompt for generating hyper-realistic 3D architectural visualizations of a two-story exhibition booth for a brand like Tesla. It uses placeholders for style, form, materials, and features, focusing on photorealistic rendering, specific lighting, and a cutting-edge tech aesthetic.\n\nPrompt\n\nHyper-realistic 3D architectural visualization of a \\[STYLE: e.g., minimalist/futuristic\\] two-story exhibition booth for Tesla, set against a solid dark grey studio background. The structure features \\[FORM: e.g., sweeping angular geometry with clean lines\\] design constructed from \\[MATERIAL: e.g., matte anodized aluminum and tempered glass\\] with \\[COLOR: e.g., Tesla signature red (#E82127) accents and charcoal black\\]. The ground floor centers around \\[GROUND-FEATURE: e.g., an interactive EV display platform with integrated LED floor lighting\\], reflecting Tesla’s focus on innovation and sustainability. A \\[STAIRS-TYPE: e.g., cantilevered floating staircase with glass balustrades\\] leads to the upper mezzanine level, designed as \\[UPPER-FEATURE: e.g., a collaborative lounge and consultation area with panoramic brand graphics and natural light simulation\\]. The lighting is \\[LIGHTING: e.g., soft natural daylight balanced with focused architectural accent lights\\], creating high-quality shadows and depth. The perspective is a wide-angle elevated view, capturing a \\[VIBE: e.g., cutting-edge tech minimalism with energetic brand presence\\] aesthetic, rendered with photorealistic textures.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@Nicolechan](https://x.com/stark_nico99 \"@Nicolechan\")\n\nNov 20, 2025\n\n[\n\n### Wide quote card with portrait and Chinese/English customization\n\n](https://x.com/stark_nico99/status/1991718646570426763)\n\n![Wide quote card with portrait and Chinese/English customization - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886933714_5zqn1e_G6QBjQHbgAE3Yt_-300x168.jpg)\n\n![Wide quote card with portrait and Chinese/English customization - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886938314_wbcfc7_G6QBiiracAInQ8z-300x168.jpg)\n\n![Wide quote card with portrait and Chinese/English customization - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886941069_1d9ace_G6QBii_acAIRxKd-300x127.jpg)\n\n![Wide quote card with portrait and Chinese/English customization - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763886946388_nwahev_G6QBikOaEAAmYkO-300x166.jpg)\n\nA prompt for generating a wide quote card featuring a famous person’s portrait, with a brown background, light-gold serif quote text, and layout where text occupies two-thirds and the person one-third. The quote text and author are parameterized for reuse.\n\nPromptOriginal\n\nA wide quote card featuring a famous person, with a brown background and a light-gold serif font for the quote: “Stay Hungry, Stay Foolish” and smaller text: “—Steve Jobs.” There is a large, subtle quotation mark before the text. The portrait of the person is on the left, the text on the right. The text occupies two-thirds of the image and the portrait one-third, with a slight gradient transition effect on the portrait.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@ひでもん | AI開発@ニュース発信](https://x.com/okknews \"@ひでもん | AI開発@ニュース発信\")\n\nNov 22, 2025\n\n[\n\n### Chalkboard-style AI news summary\n\n](https://x.com/okknews/status/1992173611520868372)\n\n![Chalkboard-style AI news summary - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885620059_vzaj75_G6WfVvIbAAEgvYg-300x300.jpg)\n\n![Chalkboard-style AI news summary - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885622901_pk1vka_G6P2CkracAINIfP-300x300.jpg)\n\nA Japanese prompt for turning AI news content into a hand-drawn, teacher-style chalkboard diagram with explanations.\n\nPromptOriginal\n\nUsing the following content, summarize the news in a chalkboard-style, hand‑written look, and break it down with diagrams and easy‑to‑understand expressions as if a teacher had written it. —- Search results from Grok\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@VoxcatAI](https://x.com/VoxcatAI \"@VoxcatAI\")\n\nDec 3, 2025\n\n[\n\n### Luxury minimalist product photography based on a reference image\n\n](https://x.com/VoxcatAI/status/1996273073725780161)\n\n![Luxury minimalist product photography based on a reference image](https://cms-assets.youmind.com/media/1764915823213_skhwpb_G7Qvxi5bIAAqpfX-300x372.jpg)\n\nPREVIEW\n\nA prompt for generating high-end, minimalist commercial product photography in the style of luxury brand ads, using an uploaded reference image of the core product as the base.\n\nPromptOriginal\n\nUsing my uploaded reference image as the base, generate a minimalist, high-quality commercial still life photograph with the aesthetic of a luxury brand advertisement. Preserve the general shape, proportions, and main color scheme of the core product in the reference so that it is instantly recognizable as the same product, but upgrade the overall texture and atmosphere of the image, making it look like an ad for a top-tier international fragrance, skincare item, or high-end electronic product. Use a vertical 4:5 composition. The background should be a large area of clean, neutral negative space, such as soft off-white, cool gray, or light beige, creating a quiet, restrained, and expensive studio environment. Apart from the core product and a minimal number of necessary supports, do not add any extra decorations. No clutter, no elaborate scene setup—only keep very simple geometric supports (such as a plain white cube, a cylinder, or a thin transparent panel). The supports must be simple and low-profile, existing only to hold and accentuate the product. Strongly emphasize the material details of the product, and let the lighting fully serve those materials: Show frosted glass with a fine, soft matte texture, ceramics with a matte or slightly glazed feel, and polished metal with clean, sharp specular highlights. Liquids should have clearly visible viscosity and volume. Avoid any cheap plastic feel, complex patterns, or gaudy stickers; the overall material quality must feel cool, restrained, and luxurious. Use professional studio lighting: mainly soft, diffused light from softboxes, plus precise rim light outlining the product’s shape. The contours should be crisp and layered, and the shadows should be soft and clean, with no noise or dirty shadow patches. You may use a near-macro viewpoint, moving in closer to the product to highlight materials and details, while preserving ample negative space around the frame so the product can \"speak for itself\" in the emptiness. Keep the overall color scheme neutral and calm. The product’s own color can be slightly more saturated, making it the single visual focal point in the scene. Do not use exaggerated gradient backgrounds, flashy colored lighting, or e-commerce promo aesthetics. No large-price text, labels, or cartoon graphics. The final result must be a high-resolution commercial key visual that looks ready for a magazine back cover or a high-end brand announcement poster: minimalist, quiet, high-end, with the core product confidently centered, surrounded by clean negative space and precisely controlled lighting.\n\nTry it now\n\n[![WordsCard](https://cdn.gooo.ai/web-images/5e0199359a6eb05237a68c9cdc7e6d650f01bf6532a91f73e5fad5541088c17c@small)\n\nAI Shortcut\n\nInstall\n\n\n\n](https://youmind.com/shortcuts/dc2099fa-32d7-465a-a5d2-70388b11d8bd)\n\n[\n\n### WordsCard\n\nLike a professional designer, generate high-quality children's literacy flashcards with one click. Realistic patterns, soft backgrounds, standard phonetic notations—instantly elevating teaching efficiency.\n\n\n\n](https://youmind.com/shortcuts/dc2099fa-32d7-465a-a5d2-70388b11d8bd)[Install on YouMind](https://youmind.com/shortcuts/dc2099fa-32d7-465a-a5d2-70388b11d8bd)\n\nPromptOriginal\n\nFeatured\n\nBY[@Marky @ Easy-Peasy.AI](https://x.com/easy_peasy_ai \"@Marky @ Easy-Peasy.AI\")\n\nDec 3, 2025\n\n[\n\n### 2005 Sony CyberShot mall food court snapshot prompt\n\n](https://x.com/easy_peasy_ai/status/1996232508162310472)\n\n![2005 Sony CyberShot mall food court snapshot prompt - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909293283_f5655t_G7QK4bqbsAEzqlB-300x300.jpg)\n\n![2005 Sony CyberShot mall food court snapshot prompt - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909295848_nioupc_G7QK4b-acAA2_c9-300x300.jpg)\n\nAn image prompt that recreates an early-digital-camera mall food court photo with teens, harsh flash, date stamp, and Myspace-era aesthetics.\n\nPrompt\n\nA low-resolution digital photo taken on a 2005 Sony CyberShot. A group of teenagers hanging out in a mall food court. Harsh on-camera flash, slightly blown-out highlights, digital noise in the shadows. The skin texture looks slightly waxy due to early digital processing. Orange date stamp in the bottom right corner reading \"04/12/2005\". Candid, awkward angles, Myspace photo aesthetic.\n\nTry it now\n\nPromptOriginal\n\nBY[@松果先森](https://x.com/songguoxiansen \"@松果先森\")\n\n1 day ago\n\n[\n\n### Christmas Skincare Set Promotion Card\n\n](https://x.com/songguoxiansen/status/2003096613359853946)\n\n![Christmas Skincare Set Promotion Card](https://cms-assets.youmind.com/media/1766489525155_o9dyiz_G8xts6caYAAP660-300x537.jpg)\n\nPREVIEW\n\nA Nano banana pro prompt designed to generate a promotional card for a Christmas skincare product set. The card features a festive, warm, and luxurious aesthetic with a focus on the product packaging and a clear call to action.\n\nPromptOriginal\n\nChristmas skincare product set promotion card, warm tones, festive atmosphere, luxurious, highlighting product packaging, including promotion information, and a CTA button. Christmas Skincare Set, Limited Time Discount, Shop Now, 8k, ultra clear, cinematic, soft lighting, depth of field, product photography, exquisite, detailed, high quality\n\nTry it now\n\nPromptOriginal\n\nBY[@Lex](https://x.com/lexx_aura \"@Lex\")\n\n1 day ago\n\n[\n\n### Red Slip Dress Bathroom Selfie Prompt\n\n](https://x.com/lexx_aura/status/2003044060680892497)\n\n![Red Slip Dress Bathroom Selfie Prompt](https://cms-assets.youmind.com/media/1766489466566_lboypl_G8w98P6XAAAXlKO-300x402.jpg)\n\nPREVIEW\n\nA detailed image generation prompt structured for a hyperrealistic flash photograph of a young woman in a vibrant red satin slip dress, leaning against a marble bathroom vanity. The prompt specifies subject details, clothing, pose, environment (modern luxury bathroom with reflections), and lighting (direct flash photography) to achieve an influencer-style candid snapshot.\n\nPrompt\n\n{   \"prompt\\_structure\": {     \"subject\": {       \"description\": \"Young woman with light skin tone\",       \"hair\": \"Long, voluminous dark brunette hair, styled in loose waves, center part, reaching past shoulders\",       \"face\": \"Oval face shape, light-colored eyes (appearing green or grey), soft makeup with defined eyeliner and neutral glossy lips\",       \"expression\": \"Neutral, alluring gaze, direct eye contact with the camera\"     },     \"clothing\": {       \"type\": \"Slip dress / Chemise\",       \"color\": \"Vibrant red\",       \"material\": \"Satin or silk finish with a glossy sheen\",       \"details\": \"Spaghetti straps, V-neckline with scalloped lace trim, lace detailing near the hem, mini length\",       \"accessories\": \"Small silver pendant necklace, ring on ring finger of left hand\"     },     \"pose\": {       \"stance\": \"Leaning backward against a bathroom vanity counter\",       \"arms\": \"Arms extended downward, hands gripping or resting on the edge of the marble countertop\",       \"orientation\": \"Front-facing\"     },     \"environment\": {       \"setting\": \"Modern luxury bathroom\",       \"elements\": \\[         \"White marble countertop\",         \"Dark wood vanity cabinetry\",         \"Large wall mirror behind subject\",         \"Circular magnifying mirror on a gold/brass stand\",         \"Glass shower door/enclosure in background\"       \\],       \"reflections\": \"Subject's back and hair visible in the large mirror behind her\"     },     \"lighting\\_and\\_style\": {       \"lighting\": \"Direct flash photography, bright front illumination with slight shadows behind the subject\",       \"aesthetic\": \"Influencer lifestyle, candid snapshot, high-fidelity, 'night out' preparation vibe\",       \"color\\_palette\": \"Red, warm skin tones, cool whites and dark browns in background\"     }   } }\n\nTry it now\n\nPromptOriginal\n\nBY[@Lore](https://x.com/l_w_lorenzen \"@Lore\")\n\n1 day ago\n\n[\n\n### E-Girl Y2K Flash Selfie Prompt\n\n](https://x.com/l_w_lorenzen/status/2002997024996892830)\n\n![E-Girl Y2K Flash Selfie Prompt](https://cms-assets.youmind.com/media/1766489558942_eqiqvu_G8wTKYZbMAAifq_-300x300.jpg)\n\nPREVIEW\n\nA prompt for generating a high-angle, high-contrast selfie image with a Y2K grunge/E-girl aesthetic. It specifies the subject's silver-grey hair in pigtails, heavy eyeliner, a corset top, and a silver cross necklace, set in a dimly lit bedroom with purple LED accent lighting and harsh direct flash photography.\n\nPrompt\n\n{ \"image\\_generation\\_prompt\": { \"subject\": { \"demographics\": \"Young woman, fair skin, slim build\", \"hair\": { \"color\": \"{argument name=\\\\\"hair color\\\\\" default=\\\\\"Silver grey\\\\\"}\", \"style\": \"High pigtails, straight texture\", \"details\": \"Bangs framing the forehead and sides of the face\" }, \"face\\_and\\_makeup\": { \"eyes\": \"Green/hazel eyes, heavy winged eyeliner, long lashes\", \"expression\": \"Sultry gaze, slightly parted lips\", \"action\": \"Right index finger touching lower lip or corner of mouth\" } }, \"attire\": { \"clothing\": \"Sleeveless corset-style top with deep scoop neckline and visible hook-and-eye closures, partially visible skirt or shorts\", \"accessories\": \"Silver cross pendant necklace on a thin chain\" }, \"pose\": { \"type\": \"High-angle selfie\", \"body\\_position\": \"Arm extended toward camera, body angled slightly\" }, \"setting\": { \"location\": \"Bedroom interior\", \"background\\_elements\": \\[ \"Large white textured pillows (tufted or knit)\", \"White sheets\", \"Dark wall\" \\], \"ambient\\_lighting\": \"Purple LED strip light running horizontally behind the headboard\", \"atmosphere\": \"Dimly lit room with colored accent lighting\" }, \"style\\_and\\_technical\": { \"aesthetic\": \\[ \"E-girl\", \"Y2K grunge\", \"2000s digital aesthetic\" \\], \"lighting\\_technique\": \"Direct on-camera flash, harsh high-contrast lighting on subject against darker background\", \"camera\\_settings\": { \"angle\": \"High-angle wide selfie\", \"distortion\": \"Slight wide-angle distortion\", \"color\\_profile\": \"Full color, natural color rendering with vibrant neon purple accent\" }, \"aspect\\_ratio\": \"3:4\" } }\n\nTry it now\n\nPromptOriginal\n\nBY[@Melisa♡](https://x.com/xmliisu \"@Melisa♡\")\n\n1 day ago\n\n[\n\n### E-girl Y2K Grunge Selfie Prompt\n\n](https://x.com/xmliisu/status/2002937136815993283)\n\n![E-girl Y2K Grunge Selfie Prompt - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489516575_0fzbgz_G8uGICQXQAIK0d9-300x402.jpg)\n\n![E-girl Y2K Grunge Selfie Prompt - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489516821_8c79ab_G8uGICLXwAA_kM1-300x402.jpg)\n\nA structured prompt designed to generate an 'E-girl' style, high-angle mirror selfie with a Y2K grunge aesthetic. It specifies silver-grey hair in pigtails, heavy makeup, a corset top, and a dimly lit bedroom setting with purple LED accent lighting and harsh direct flash.\n\nPrompt\n\n{ \"image\\_generation\\_prompt\": { \"subject\": { \"demographics\": \"Young woman, fair skin, slim build\", \"hair\": { \"color\": \"Silver grey\", \"style\": \"High pigtails, straight texture\", \"details\": \"Bangs framing the forehead and sides of the face\" }, \"face\\_and\\_makeup\": { \"eyes\": \"Green/hazel eyes, heavy winged eyeliner, long lashes\", \"expression\": \"Sultry gaze, slightly parted lips\", \"action\": \"Right index finger touching lower lip or corner of mouth\" } }, \"attire\": { \"clothing\": \"Sleeveless corset-style top with deep scoop neckline and visible hook-and-eye closures, partially visible skirt or shorts\", \"accessories\": \"Silver cross pendant necklace on a thin chain\" }, \"pose\": { \"type\": \"High-angle selfie\", \"body\\_position\": \"Arm extended toward camera, body angled slightly\" }, \"setting\": { \"location\": \"Bedroom interior\", \"background\\_elements\": \\[ \"Large white textured pillows (tufted or knit)\", \"White sheets\", \"Dark wall\" \\], \"ambient\\_lighting\": \"Purple LED strip light running horizontally behind the headboard\", \"atmosphere\": \"Dimly lit room with colored accent lighting\" }, \"style\\_and\\_technical\": { \"aesthetic\": \\[ \"E-girl\", \"Y2K grunge\", \"2000s digital aesthetic\" \\], \"lighting\\_technique\": \"Direct on-camera flash, harsh high-contrast lighting on subject against darker background\", \"camera\\_settings\": { \"angle\": \"High-angle wide selfie\", \"distortion\": \"Slight wide-angle distortion\", \"color\\_profile\": \"Full color, natural color rendering with vibrant neon purple accent\" }, \"aspect\\_ratio\": \"3:4\" } } }\n\nTry it now\n\n[![Geek-style ASCII character poster](https://cdn.gooo.ai/web-images/c9c0bb4f1c7b0554a21d97ed26ffc5a64e10d33c3d1b70526ef72f11ea9bdb0d@small)\n\nAI Shortcut\n\nInstall\n\n\n\n](https://youmind.com/shortcuts/9c9c2803-4297-419a-b5f3-f13b8fbdf5c5)\n\n[\n\n### Geek-style ASCII character poster\n\nTransform your ideas into stunning Swiss-ASCII posters. Generate mathematically precise, full-bleed designs with glowing ASCII objects and perfect grid alignment, all in seconds.\n\n\n\n](https://youmind.com/shortcuts/9c9c2803-4297-419a-b5f3-f13b8fbdf5c5)[Install on YouMind](https://youmind.com/shortcuts/9c9c2803-4297-419a-b5f3-f13b8fbdf5c5)\n\nPromptOriginal\n\nBY[@てんねん](https://x.com/munou_ac \"@てんねん\")\n\n2 days ago\n\n[\n\n### Nano Banana Pro X Header Image Generation Prompt\n\n](https://x.com/munou_ac/status/2002850192207597760)\n\n![Nano Banana Pro X Header Image Generation Prompt - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489525059_2o3mqx_G8uNoWzaAAA1VwE-300x99.jpg)\n\n![Nano Banana Pro X Header Image Generation Prompt - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489525611_5q0gkx_G8uNocrboAAp-oB-300x99.jpg)\n\n![Nano Banana Pro X Header Image Generation Prompt - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489525731_bqh21d_G8uNoWyaoAAOvlV-300x99.jpg)\n\n![Nano Banana Pro X Header Image Generation Prompt - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489526547_e79955_G8uNoWzbIAAN3N7-300x99.jpg)\n\nThis is a detailed prompt designed for Nano Banana Pro to generate an X (Twitter) header image based on a reference image. It includes a custom logo design based on user-specified text and a style preset, and offers options for face zooming to control the composition within a defined safe zone. It's an updated version of a previous prompt, focusing on practicality for profile image creation.\n\nPromptOriginal\n\n\\# ===== USER CONTROLS ===== title\\_text: \"<<YOUR\\_TEXT>>\" title\\_style\\_preset: \"cool\" # cool, cute, cool\\_cute, luxury, pop, cyber, minimal, retro, kawaii face\\_zoom: \"off\" # off, on subject: > Create a 3:1 wide banner using the provided reference image content. The primary face must be centered inside an invisible safe zone (not drawn), and a title logo (derived from title\\_text + title\\_style\\_preset) must be placed inside the same safe zone. composition: > Aspect ratio 3:1. Invisible safe zone (DO NOT draw it): - Left margin: 15% of width - Right margin: 15% of width - Top margin: 16% of height - Bottom margin: 16% of height Keep the entire face AND the entire title logo fully inside this safe zone. Background may extend to the edges. action: > Place the reference image content with maximum fidelity. Auto-crop/scale/reposition to fit a 3:1 banner with no stretching. Detect the primary face (if multiple faces, pick the largest/most prominent). Center the primary face within the safe zone both horizontally and vertically. Never crop off the face/eyes; keep the full face comfortably inside the safe zone (not near edges). Face zoom behavior: - If face\\_zoom is OFF: keep the original framing as much as possible while still centering the face in the safe zone. - If face\\_zoom is ON: zoom/crop to a bust-up portrait centered on the face (head and shoulders visible; include upper chest; do not crop the top of the head or chin; keep facial features prominent). Create negative space inside the safe zone for the title logo by adjusting crop/reposition/out\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@セミナー講師専門AIコンシェルジュ｜工藤 晶](https://x.com/akirakudo_ai \"@セミナー講師専門AIコンシェルジュ｜工藤 晶\")\n\nNov 22, 2025\n\n[\n\n### Hand-drawn style header image prompt from photo\n\n](https://x.com/akirakudo_ai/status/1992096860765561190)\n\n![Hand-drawn style header image prompt from photo - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885651870_4szbai_G6VZiROagAAqsIh-300x168.jpg)\n\n![Hand-drawn style header image prompt from photo - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1763885654537_qf6h9o_G6VZiRWaIAA_9x5-300x380.jpg)\n\nPrompt for a hand-drawn style header image of a person introducing Nano Banana Pro\n\nPromptOriginal\n\nCompletely recreate the uploaded person. Make it a header image for a note article where that person introduces “Nano Banana Pro”. Aspect ratio: horizontal 16:9. Style and colors: simple, hand-drawn style, italic, with a blue and green gradient. Title text: “In-depth explanation of Google’s new AI ‘Nano Banana Pro’”.\n\nTry it now\n\n![Nano Banana Pro Hands-On: 10 Mind-Blowing Real-World Cases](https://cms-assets.youmind.com/media/1763948516286_6slrwd_Generated_Image_November_24_2025_-_9_41AM-900x604.jpg)\n\nBLOG\n\n### Nano Banana Pro Hands-On: 10 Mind-Blowing Real-World Cases\n\n[EXPLORE MORE CASES](https://youmind.com/blog/nano-banana-pro-10-real-cases)\n\nPromptOriginal\n\nFeatured\n\nBY[@松果先森](https://x.com/songguoxiansen \"@松果先森\")\n\nNov 21, 2025\n\n[\n\n### Dream diary with Kirby blowing bubbles\n\n](https://x.com/songguoxiansen/status/1991795708308189668)\n\n![Dream diary with Kirby blowing bubbles](https://cms-assets.youmind.com/media/1763886710060_ndpy3q_G6RHoGna4AArBDN-300x164.jpg)\n\nPREVIEW\n\nA cute prompt for a dreamy diary-style illustration of a pink Kirby sleeping on a star, blowing rainbow bubbles amid pastel clouds and candy.\n\nPromptOriginal\n\nDream diary. A pink Kirby lying asleep on a star, blowing rainbow-colored bubbles from its mouth. Soft macaron color palette, cloud and candy stickers, glittery crayon-like details, dreamy and sweet.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@VoxcatAI](https://x.com/VoxcatAI \"@VoxcatAI\")\n\nDec 1, 2025\n\n[\n\n### Edo-period Ukiyo-e reinterpretation of a modern scene\n\n](https://x.com/VoxcatAI/status/1995497350543110411)\n\n![Edo-period Ukiyo-e reinterpretation of a modern scene](https://cms-assets.youmind.com/media/1764915832381_renotr_G7FuPlzbYAAsuo2-300x401.jpg)\n\nPREVIEW\n\nA highly-structured image prompt to depict a modern-day scene reimagined as an Edo-period Japanese Ukiyo-e woodblock print, with detailed guidance on anachronistic tech, composition, texture, and color.\n\nPrompt\n\nA Japanese Edo-period Ukiyo-e woodblock print (浮世絵 木版画). The overall feeling is a surreal collaboration between masters like Hokusai and Hiroshige, reimagining modern technology through an ancient lens. \\*\\*The Scene:\\*\\* 繁忙的涩谷十字路口 \\*\\*Edo Transformation Logic:\\*\\* Characters wear Edo-era kimono but perform modern actions. All technology is transformed into surreal Edo equivalents: \\* \\*\\*Smartphones\\*\\* are glowing, illustrated paper scrolls being read intently. \\* \\*\\*Metro stations/Trains\\*\\* are giant articulated wooden centipede carriages shuffling through crowds. \\* \\*\\*Skyscrapers\\*\\* are reimagined as endless, towering wooden pagodas reaching into dramatic clouds. \\* \\*\\*Robots/Mecha\\*\\* appear as giant, armored woodblock golems. The composition uses a flattened perspective with large, bold, hand-carved ink outlines (太い墨線). The background features heavily stylized Ukiyo-e wave patterns and dramatic, swirling clouds, with a distant Mt. Fuji visible on the horizon. The image must look like a physical print, not a digital painting. \\* \\*\\*Texture:\\*\\* Strong visible wood grain texture (木目) and rough paper fibers throughout the piece. \\* \\*\\*Printing Imperfections:\\*\\* Pigment bleeding is evident. Crucially, simulate hand-pressed plates with slight \\*\\*color misalignment (版ズレ)\\*\\* for authenticity. \\* \\*\\*Color Palette:\\*\\* Strictly limited to traditional mineral pigments. Dominant use of Prussian blue (浮世絵ブルー), vermilion red, and muted yellow ochre. \\* \\*\\*Lighting:\\*\\* Soft, flat, shadow-free lighting with no digital gradients. \\* \\*\\*Aspect Ratio:\\*\\* 3:4 vertical poster. \\* \\*\\*Extras:\\*\\* Include vertical Japanese calligraphy describing the scene and a traditional red artist seal stamp (落款) in a corner.\n\nTry it now\n\nPromptOriginal\n\nBY[@ttmouse - 豆爸](https://x.com/ttmouse \"@ttmouse - 豆爸\")\n\n1 day ago\n\n[\n\n### Nano Banana Pro Community Prompt Concepts Summary\n\n](https://x.com/ttmouse/status/2003112308319375843)\n\n![Nano Banana Pro Community Prompt Concepts Summary](https://cms-assets.youmind.com/media/1766489559958_58r1mn_G8x8AJIX0AAX7ny-300x623.jpg)\n\nPREVIEW\n\nThis tweet summarizes popular creative concepts and prompt types trending in the Nano Banana Pro community, including generating giant surreal monuments (like pencils), high-end functional drink concepts, rubber hose 3D cartoon characters, and dystopian book dioramas. It does not contain a single executable prompt but lists several high-level ideas.\n\nPromptOriginal\n\nPrompt for generating giant surreal monuments from everyday objects, such as pencils, creating surreal city sculpture scenes. Prompt for a high-end functional beverage concept from a non-beverage brand, sharing detailed cosmic high-aesthetics prompts. Prompt for rubber hose 3D style cartoon characters, generating a series of cute dynamic poses. Universal 3x3 grid advertising prompt perfectly achieving product consistency in Nano Banana Pro. Dreamy prompt for augmented reality Spotify play cards surrounding a person, generating sci-fi dynamic effects. Prompt for generating personalized sticker packs from uploaded photos, featuring cute designs in various clothing styles. Creative prompt for dystopian novel-themed miniature worlds inside open books, presented in a diptych format. Prompt for polymer clay style celebrity miniature dolls, generating cute, handcrafted-looking portraits. Prompt for generating Bollywood star social brand studio portraits from uploaded photos. Prompt for realistic 3D rendering scenes of fictional Arrow Dynamics equipment, visualizing high-end product concepts. Prompt for frozen tundra themed human scenes, generating a blend of cold-toned, magnificent nature. Prompt for giant cosmic hourglass mysterious scenes, directly outputting surreal cinematic works. Prompt for ancient Egyptian Eye of Horus stone wall with mysterious golden light, directly outputting classic mystical style. Simple prompt for generating a horror video effect where facial skin opens to reveal internal machinery. Prompt for Bollywood poster style Indian actress in a blue sari, creating elegant and dreamy compositions. Prompt for Knolling flat lay photography of popular items from one's birth year.\n\nTry it now\n\nPromptOriginal\n\nBY[@Indie Maker | AI](https://x.com/oslook_ \"@Indie Maker | AI\")\n\n1 day ago\n\n[\n\n### Infographic/Cover Design Style Template (LLM/Image)\n\n](https://x.com/oslook_/status/2003090197551177998)\n\n![Infographic/Cover Design Style Template (LLM/Image) - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489540045_9u5hln_G8xmNNOa8AAqcIE-300x164.jpg)\n\n![Infographic/Cover Design Style Template (LLM/Image) - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489540033_qeup4n_G8xmOoha8AAryJB-300x164.jpg)\n\nA simple template for generating infographics or cover designs using Nano Banana Pro, allowing the user to specify the desired style. Two example styles are provided: Retro/Vintage (using old fonts, textures, and tones, often combined with modern elements) and Hand-Drawn/Illustrative (friendly, warm, and personal, suitable for narrative content).\n\nPromptOriginal\n\nxxxxx, please generate an infographic, using the style 【xxxx】.\n\nTry it now\n\nPromptOriginal\n\nBY[@Adam也叫吉米](https://x.com/Adam38363368936 \"@Adam也叫吉米\")\n\n1 day ago\n\n[\n\n### Christmas Box Challenge Photo Collage Prompt\n\n](https://x.com/Adam38363368936/status/2003025725675204789)\n\n![Christmas Box Challenge Photo Collage Prompt](https://cms-assets.youmind.com/media/1766489532891_40vkn5_G8wsmbracAEoQKc-300x504.jpg)\n\nPREVIEW\n\nA highly specific prompt for Nano Banana Pro to generate an ultra-realistic, high-quality 2x2 creative photo collage of a young woman posing inside cardboard boxes for a Christmas-themed challenge. The prompt emphasizes panel layout and interaction, specifically requiring a continuous action (red wine pouring) across the two right-hand panels, while maintaining the subject's face without change.\n\nPrompt\n\nUse the face without any change.A high-quality 2x2 creative photo collage of a young woman with long wavy black hair , posing inside cardboard boxes for a Christmas-themed challenge. She wears a cream, red, and green Fair Isle knit sweater. Layout & Interaction (Crucial):The right side features a continuous action across two panels. Red wine is poured from the top-right panel and flows vertically down into the bottom-right panel. Panel Details: Top Left: She blows artificial snow from her palms towards the camera. Bottom Left: She holds glowing fairy lights and a red bauble, smiling warmly. Top Right: She leans on the box edge, holding a wine bottle, pouring red wine downwards so the liquid stream exits the bottom of this frame. Bottom Right: She is positioned below, holding a wine glass that catches the stream of wine pouring down from the panel above. She is looking up, watching the wine flow into her glass. Style: Creative box challenge photography, seamless cross-panel interaction, festive mood, soft studio lighting, ultra-realistic textures.\n\nTry it now\n\nPromptOriginal\n\nBY[@Lore](https://x.com/l_w_lorenzen \"@Lore\")\n\n1 day ago\n\n[\n\n### Platinum Blonde Bedroom Mirror Selfie Prompt (Detailed)\n\n](https://x.com/l_w_lorenzen/status/2002972442512519404)\n\n![Platinum Blonde Bedroom Mirror Selfie Prompt (Detailed)](https://cms-assets.youmind.com/media/1766489489320_rleskv_G8v8sbOacAARcjP-300x300.jpg)\n\nPREVIEW\n\nA highly detailed, structured prompt for generating a vertical mirror selfie of a platinum blonde woman in loungewear (ribbed tank and boy shorts) in a cozy bedroom setting, focusing on the 'classic high-angle mirror selfie pose' and specific details like phone accessories and lighting.\n\nPrompt\n\n{ \"subject\": { \"description\": \"Young woman taking bedroom mirror selfie, phone held high, casual loungewear moment\", \"age\": \"early 20s\", \"expression\": { \"eyes\": \"looking up at phone screen, soft doe eyes\", \"mouth\": \"soft pout, lips slightly pursed\", \"overall\": \"that 'checking my angles' focused selfie face\" }, \"hair\": { \"color\": \"platinum blonde, white-silver\", \"style\": \"messy high ponytail, loose and undone\", \"details\": \"lots of pieces falling out, face-framing strands, effortless messy\" }, \"body\": { \"frame\": \"petite, slim, toned\", \"waist\": \"small, defined, bare midriff\", \"stomach\": \"flat, toned, fully visible\", \"hips\": \"feminine curve\" }, \"pose\": { \"phone\\_arm\": \"raised HIGH above head, extended up\", \"other\\_arm\": \"down, hand resting on hip/thigh\", \"stance\": \"slight hip cock, weight shifted\", \"torso\": \"slight twist, elongated from raised arm\", \"overall\": \"the classic high-angle mirror selfie pose\" }, \"clothing\": { \"top\": { \"type\": \"Blake ribbed tank top\", \"fit\": \"fitted, cropped above belly button\", \"neckline\": \"scoop neck, simple\", \"effect\": \"basic but shows shape\" }, \"bottom\": { \"type\": \"White cotton boy shorts / mini shorts\", \"fit\": \"tight, very short, sits low on hips\", \"style\": \"lounge shorts, underwear-adjacent\", \"effect\": \"barely there, shows legs completely\" } }, \"accessories\": { \"phone\": \"iPhone with MagSafe ring, clear case\", \"hair\\_tie\": \"scrunchie in ponytail\", \"jewelry\": \"minimal, maybe small earrings\" } }, \"environment\": { \"location\": \"bedroom\", \"mirror\": \"full-length standing mirror\", \"room\\_details\": { \"bed\": \"visible in reflection, unmade, grey/beige bedding\", \"lamp\": \"warm bedside lamp glowing\", \"chair\": \"gaming/desk chair with clothes draped\", \"lights\": \"LED strip lights on wall\", \"clothes\": \"scattered on chair, lived-in\" }, \"lighting\": \"warm lamp light + LED strips, cozy evening\" }, \"photography\": { \"style\": \"mirror selfie, high angle\", \"framing\": \"thighs to above head\", \"angle\": \"phone above head shooting down\", \"quality\": \"iPhone\", \"aspect\": \"4:5 vertical\" }, \"color\\_story\": { \"her\": \"white tank, grey shorts, platinum hair\", \"room\": \"beige walls, grey bedding, warm lamp glow\", \"palette\": \"neutral, soft, cozy tones\" }, \"vibe\": { \"energy\": \"casual night in, loungewear content\", \"mood\": \"effortless, 'just hanging out'\", \"authenticity\": \"real bedroom, real mess, real girl\", \"caption\": \"'fit check' or 'staying in' or '🤍'\" } }\n\nTry it now\n\nPromptOriginal\n\nBY[@けこねこ](https://x.com/soranoblue3 \"@けこねこ\")\n\n2 days ago\n\n[\n\n### Star Present for an Angel Girl\n\n](https://x.com/soranoblue3/status/2002865913520173097)\n\n![Star Present for an Angel Girl](https://cms-assets.youmind.com/media/1766489542280_kxkawu_G8ub7d_aIAAa9tP-300x402.jpg)\n\nPREVIEW\n\nA prompt used with Nano Banana Pro to generate an image of a star present for an angel girl, likely used for a holiday greeting or seasonal content.\n\nPromptOriginal\n\nA slightly early star present for you from yesterday's angel girl~.｡.:\\*☆\n\nTry it now\n\nPromptOriginal\n\nBY[@KeorUnreal](https://x.com/KeorUnreal \"@KeorUnreal\")\n\n2 days ago\n\n[\n\n### Gold Symbiote Mirror Selfie Prompt\n\n](https://x.com/KeorUnreal/status/2002854337475678587)\n\n![Gold Symbiote Mirror Selfie Prompt](https://cms-assets.youmind.com/media/1766489557239_jx2f4f_G8uRZojWQAAtsno-300x537.jpg)\n\nPREVIEW\n\nA detailed JSON prompt for Nano Banana Pro to generate a photorealistic, high-quality mirror selfie of a woman wearing a form-fitting gold symbiote-inspired superhero bodysuit in a dimly lit luxury bathroom, emphasizing a lo-fi social media aesthetic and specific makeup details.\n\nPrompt\n\n{ \"shot\": \"A tight close-up mirror selfie\", \"subject\": { \"appearance\": \"a stunning woman\", \"hair\": \"short hair\", \"pose\": \"sitting casually sideways on a white bathroom vanity counter\", \"gaze\": \"looking at the mirror\" }, \"outfit\": { \"bodysuit\": \"form-fitting gold symbiote-inspired superhero bodysuit with subtle dark web texturing\", \"emblem\": \"prominent white spider emblem on the chest\" }, \"phone\": { \"device\": \"red smartphone\", \"case\": \"white spider logo case\", \"action\": \"holding it up to capture the reflection\" }, \"environment\": { \"location\": \"luxury bathroom\", \"lighting\": \"dimly lit with warm, soft indoor lighting\", \"atmosphere\": \"intimate atmosphere with soft shadows\", \"visible\\_elements\": \"only a partial section of the white sink basin and counter surface visible at the bottom of the frame\", \"mirror\": \"mirror edges are cropped out of view\" }, \"aesthetic\": \"high quality, photorealistic, lo-fi social media aesthetic\", \"makeup\": { \"blush\": \"prominent soft pink blush on her cheeks\", \"finish\": \"glowy makeup\", \"highlighter\": \"on the tip of her nose\", \"lips\": \"slightly parted soft warm pink lips\" }, \"skin\": \"highly detailed skin texture\" \"lighting\\_detail\": \"even, invisible front illumination that softly brightens the face with neutral white light, no visible light source, no shadows, no reflections, no hotspots\", \"quality\": \"no blur\" }\n\nTry it now\n\nPromptOriginal\n\nBY[@ANKIT PATEL 🇮🇳 | AI](https://x.com/Ankit_patel211 \"@ANKIT PATEL 🇮🇳 | AI\")\n\n2 days ago\n\n[\n\n### Hyper-Realistic 3D Architectural Exhibition Booth Visualization\n\n](https://x.com/Ankit_patel211/status/2002846579137577429)\n\n![Hyper-Realistic 3D Architectural Exhibition Booth Visualization - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489504133_fx2tzq_G8uKWVwbsAA400C-300x300.jpg)\n\n![Hyper-Realistic 3D Architectural Exhibition Booth Visualization - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489504696_5ekkfa_G8uKWWWbIAAHs7J-300x300.jpg)\n\nA template prompt for generating hyper-realistic 3D architectural visualizations of a two-story exhibition booth for a brand like Tesla. It uses placeholders for style, form, materials, and features, focusing on photorealistic rendering, specific lighting, and a cutting-edge tech aesthetic.\n\nPrompt\n\nHyper-realistic 3D architectural visualization of a \\[STYLE: e.g., minimalist/futuristic\\] two-story exhibition booth for Tesla, set against a solid dark grey studio background. The structure features \\[FORM: e.g., sweeping angular geometry with clean lines\\] design constructed from \\[MATERIAL: e.g., matte anodized aluminum and tempered glass\\] with \\[COLOR: e.g., Tesla signature red (#E82127) accents and charcoal black\\]. The ground floor centers around \\[GROUND-FEATURE: e.g., an interactive EV display platform with integrated LED floor lighting\\], reflecting Tesla’s focus on innovation and sustainability. A \\[STAIRS-TYPE: e.g., cantilevered floating staircase with glass balustrades\\] leads to the upper mezzanine level, designed as \\[UPPER-FEATURE: e.g., a collaborative lounge and consultation area with panoramic brand graphics and natural light simulation\\]. The lighting is \\[LIGHTING: e.g., soft natural daylight balanced with focused architectural accent lights\\], creating high-quality shadows and depth. The perspective is a wide-angle elevated view, capturing a \\[VIBE: e.g., cutting-edge tech minimalism with energetic brand presence\\] aesthetic, rendered with photorealistic textures.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@Florian Gallwitz](https://x.com/FlorianGallwitz \"@Florian Gallwitz\")\n\nNov 21, 2025\n\n[\n\n### Watercolor map of Germany with labeled states\n\n](https://x.com/FlorianGallwitz/status/1991796624646091091)\n\n![Watercolor map of Germany with labeled states](https://cms-assets.youmind.com/media/1763886061720_fzgqaq_G6RIeSZXgAA7cOf-300x164.jpg)\n\nPREVIEW\n\nA German prompt to generate a watercolor-style map of Germany where all federal states are labeled in ballpoint pen, useful for educational or infographic-style maps.\n\nPromptOriginal\n\nGenerate a map of Germany in watercolor style, on which all federal states are labeled in ballpoint pen.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@KAWAI](https://x.com/kawai_design \"@KAWAI\")\n\nNov 22, 2025\n\n[\n\n### Train-ad style book advertisement image\n\n](https://x.com/kawai_design/status/1992142466255114727)\n\n![Train-ad style book advertisement image](https://cms-assets.youmind.com/media/1763885539326_yao7in_G6WBYReawAAcp2x-300x168.jpg)\n\nPREVIEW\n\nA detailed Japanese prompt for generating a 16:9 business-book-style advertisement featuring a specific book image with Japanese copy points.\n\nPromptOriginal\n\nPlease generate an advertisement image. ==== Ad specifications === - Aspect ratio: 16:9 (horizontal) - Product to advertise: the book in the first attached image - Main eye-catcher: place the book from the first attached image in a three-dimensional way - Language: Japanese - Taste: advertisement for a business book # Text to include: - Pre-head copy: 【New print run decided about one week after release】 Book “Designing from Zero with AI” now on sale and doing well. Amazon Best Seller Ranking Ranked No.1 in commercial design sales (as of 10/15) https://t.co/QxbYpfFVj6\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@Johnn](https://x.com/john_my07 \"@Johnn\")\n\nDec 3, 2025\n\n[\n\n### London outdoor restaurant portrait with Nano Banana Pro\n\n](https://x.com/john_my07/status/1996230085645623770)\n\n![London outdoor restaurant portrait with Nano Banana Pro - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909307226_bcwb2i_G7QIraQaoAANflM-300x300.jpg)\n\n![London outdoor restaurant portrait with Nano Banana Pro - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1764909309972_89pbp7_G7QIrrebwAAGCPK-300x300.jpg)\n\nA photorealistic prompt for a young woman at a calm London outdoor restaurant on a crisp March morning, with shallow depth of field and candid phone-photo vibes.\n\nPrompt\n\nCreate a photorealistic image of a young woman sitting at a relaxed outdoor restaurant in London on a cool Wednesday morning in March 2025. The sky is clear, the spring air is crisp, and the city feels calm as it wakes up. She is the focal point of the shot—wearing a light scarf, gently stirring her tea while gazing off to the side with a thoughtful expression. Everything behind her, from the waiter moving about to the soft morning traffic, should fall into a smooth blur, giving the picture the effortless, candid atmosphere of a moment casually snapped on a phone.\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@宝玉](https://x.com/dotey \"@宝玉\")\n\nOct 9, 2025\n\n[\n\n### Detailed mirror-selfie otaku room scene\n\n](https://x.com/dotey/status/1976485558319722711)\n\n![Detailed mirror-selfie otaku room scene](https://cms-assets.youmind.com/media/1763889946850_689z0h_G23i3sJW0AASGUw-300x300.jpg)\n\nPREVIEW\n\nA very detailed Nano Banana prompt describing a female mirror selfie in a blue-toned otaku computer corner, with full specifications for character, environment, lighting, camera, and negative prompts.\n\nPromptOriginal\n\n\\### Scene Mirror selfie in an otaku-style computer corner, blue color tone. ### Subject \\* Gender expression: female \\* Age: around 25 \\* Ethnicity: East Asian \\* Body type: slim, with a defined waist; natural body proportions \\* Skin tone: light neutral tone \\* Hairstyle: \\* Length: waist-length hair \\* Style: straight with slightly curled ends \\* Color: medium brown \\* Pose: \\* Stance: standing in a slight contrapposto pose \\* Right hand: holding a smartphone in front of her face (identity hidden) \\* Left arm: naturally hanging down alongside the torso \\* Torso: body leaning slightly back; waist and abdomen exposed \\* Clothing: \\* Top: light blue cropped knit cardigan, top two buttons fastened; a blue French-style bra faintly visible \\* Bottom: denim ultra-short shorts, with a blue satin ribbon bow on each side of the hips \\* Socks: blue and white horizontal striped over-the-knee socks \\* Accessory: a blue cute mascot phone case ### Environment \\* Description: bedroom computer corner seen through a wall-mounted mirror \\* Furnishings: \\* White desk \\* Single monitor showing a soft blue wallpaper (no readable text) \\* Mechanical keyboard with white keycaps on a blue desk mat \\* Mouse on a small blue mouse pad \\* PC tower on the right side with blue case lighting \\* Three anime figures on or near the PC tower \\* A poster of a pagoda on the wall \\* Cat-shaped desk lamp with blue accents \\* A transparent glass of water \\* A tall green leafy plant by the window (on the left side of the frame) \\* Color replacement: replace all originally pink elements (clothes and room decor) with blue tones (baby blue to sky blue/periwinkle blue). ### Lighting \\* Light source: daylight coming from a large window on the left side of the camera, through sheer curtains \\* Light quality: soft, diffused light \\* White balance (K): 5200 ### Camera \\* Mode: smartphone rear camera shooting via the mirror (no portrait/bokeh mode) \\* Equivalent focal length (mm): 26 \\* Distances (m): \\* Subject to mirror: 0.6 \\* Camera to mirror: 0.5 \\* Exposure: \\* Aperture (f): 1.8 \\* ISO: 100 \\* Shutter speed (s): 0.01 \\* Exposure compensation (EV): -0.3 \\* Focus: focus on the torso and shorts in the mirror image \\* Depth of field: natural smartphone deep depth of field; background clearly visible with no artificial blur \\* Composition: \\* Aspect ratio: 1:1 \\* Crop: from the top of the head to mid-thigh; include the desk, monitor, PC tower, and plant in the frame \\* Angle: slightly high angle from the mirror’s point of view \\* Composition note: keep the subject centered; to avoid wide-angle edge distortion, have her stand a bit further away and crop to a square later. ### Negative prompts \\* Any appearance of pink/magenta anywhere \\* Beauty filters/over-smoothed skin; poreless skin look \\* Exaggerated or distorted anatomy \\* NSFW, see-through fabrics, wardrobe malfunctions \\* Logos, brand names, or readable user interface text \\* Fake portrait-mode blur, CGI/illustration feel\n\nTry it now\n\nPromptOriginal\n\nFeatured\n\nBY[@K](https://x.com/ChillaiKalan__ \"@K\")\n\nNov 23, 2025\n\n[\n\n### Black and white studio side-profile portrait prompt\n\n](https://x.com/ChillaiKalan__/status/1992790080503902651)\n\n![Black and white studio side-profile portrait prompt](https://cms-assets.youmind.com/media/1764909188004_owsg5r_G6fQALWbMAAa0C--300x224.jpg)\n\nPREVIEW\n\nA concise Nano Banana Pro prompt for a hyper-realistic black and white studio portrait of a young man in side profile, using an attached reference image and specifying size and output count.\n\nPrompt\n\n{ \"Use the attached image of the person as reference. Hyper-realistic black and white studio portrait of the young man in side profile, natural hair gently falling around his face. Strong rim light accentuating his jawline and nose, dark minimalist background. Expression thoughtful and serene, cinematic lighting creating dramatic contrast and fine photographic detail.\", \"size\": \"1024x1024\", \"n\": 1 }\n\nTry it now\n\nPromptOriginal\n\nBY[@𝗦𝗮𝗻𝗶𝗮](https://x.com/saniaspeaks_ \"@𝗦𝗮𝗻𝗶𝗮\")\n\n1 day ago\n\n[\n\n### Birthday Poster Collage with Neon Text\n\n](https://x.com/saniaspeaks_/status/2003103090778759237)\n\n![Birthday Poster Collage with Neon Text - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489497108_8cn8z7_G8xzgaHaQAAPd6z-300x402.jpg)\n\n![Birthday Poster Collage with Neon Text - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489497009_fp4w7c_G8xzdU9a0AAOt1t-300x402.jpg)\n\n![Birthday Poster Collage with Neon Text - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489497426_yr9xle_G8xzdapbUAAwDZ--300x402.jpg)\n\n![Birthday Poster Collage with Neon Text - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489499276_8wn07q_G8xzdayaEAA5sLX-300x402.jpg)\n\nA structured prompt for generating a stylish, cinematic poster collage celebrating a birthday, featuring a woman (with strict identity preservation from a reference image) against a tropical wall background with integrated neon lights and glowing 'it’s my birthday!' text.\n\nPrompt\n\n{ \"type\": \"image\\_generation\\_prompt\", \"style\": \"stylish poster collage, cinematic, trendy, lifestyle editorial\", \"identity\\_preservation\": { \"use\\_uploaded\\_image\": true, \"alter\\_face\": false, \"strict\\_identity\\_lock\": true, \"notes\": \"Keep the woman from the attached image as the main character. Preserve her facial features, proportions, and overall identity exactly as in the reference.\" }, \"subject\": { \"gender\": \"female\", \"role\": \"fashion model / main character\", \"pose\": { \"style\": \"confident or relaxed\", \"body\\_language\": \"natural, stylish, self-assured\" }, \"expression\": \"confident, calm, or subtly playful\", \"outfit\": { \"style\": \"modern, cool, fashionable\", \"notes\": \"Outfit should enhance a trendy, contemporary aesthetic suitable for a magazine or social media poster\" } }, \"environment\": { \"background\": { \"type\": \"tropical wall\", \"elements\": \\[ \"lush green leaves\", \"soft neon lights integrated into the foliage\" \\], \"color\\_palette\": \"vibrant greens with neon accents\" } }, \"graphics\": { \"neon\\_text\": { \"content\": \"it’s my birthday!\", \"style\": \"glowing neon typography\", \"colors\": \\[ \"warm orange\", \"pink\" \\], \"placement\": \"balanced within the composition, clearly visible but not overpowering the subject\" } }, \"lighting\": { \"type\": \"soft, warm, cinematic lighting\", \"effects\": \\[ \"gentle shadows\", \"warm highlights on skin and outfit\", \"neon glow interacting with the subject\" \\] }, \"composition\": { \"focus\": \"strong central subject\", \"layout\": \"poster-like collage\", \"emphasis\": \\[ \"atmosphere\", \"composition\", \"glow and mood\" \\] }, \"color\\_grading\": { \"style\": \"natural yet vibrant\", \"tone\": \"warm with trendy neon accents\" }, \"quality\": { \"realism\\_level\": \"stylized rather than fully realistic\", \"detail\\_level\": \"clean, polished, editorial-quality finish\" }, \"mood\": { \"atmosphere\": \"cinematic, trendy, celebratory\", \"vibe\": \"modern lifestyle, social-media-ready\" }, \"constraints\": \\[ \"Do not change the woman’s face or identity\", \"Avoid overly realistic rendering\", \"No watermarks or logos\" \\], \"output\\_goal\": \"Create a stylish, cinematic poster-style collage featuring a woman from the reference image against a tropical neon background, with glowing celebratory text and a modern, fashionable aesthetic.\" }\n\nTry it now\n\n[![TEDStylePPT](https://cdn.gooo.ai/gen-images/b3d627602514869a171e7e70dc6ade6f6b0cc2fa5753f34b6d2c31c0822d18d1.png@small)\n\nAI Shortcut\n\nInstall\n\n\n\n](https://youmind.com/shortcuts/61d89b76-3842-4a12-89c7-b54e3d66ab7c)\n\n[\n\n### TEDStylePPT\n\nTransform your ideas into captivating TED-style presentations. Craft compelling narratives and stunning visuals that inspire and engage, all with the click of a button.\n\n\n\n](https://youmind.com/shortcuts/61d89b76-3842-4a12-89c7-b54e3d66ab7c)[Install on YouMind](https://youmind.com/shortcuts/61d89b76-3842-4a12-89c7-b54e3d66ab7c)\n\nPromptOriginal\n\nBY[@Melisa♡](https://x.com/xmliisu \"@Melisa♡\")\n\n1 day ago\n\n[\n\n### 3x3 Collage of Beauty Product Flat Lays and Portraits\n\n](https://x.com/xmliisu/status/2002983283429146835)\n\n![3x3 Collage of Beauty Product Flat Lays and Portraits](https://cms-assets.youmind.com/media/1766489486966_b2hn59_G8wGrKjXsAAgrAb-300x537.jpg)\n\nPREVIEW\n\nA highly detailed, structured prompt for generating a 3x3 grid collage featuring a young woman with vibrant red hair, wearing a maroon corset dress, showcasing gold dangle earrings, cosmetics, and various poses/reflections in a luxury interior setting.\n\nPrompt\n\n{ \"image\\_composition\": { \"type\": \"Collage\", \"layout\": \"3x3 Grid\", \"total\\_panels\": 9 }, \"subject\\_details\": { \"appearance\": \"Young woman with fair skin\", \"hair\": { \"color\": \"Vibrant red\", \"style\": \"Loose waves, shoulder-length, side-parted\", \"texture\": \"Silky and voluminous\" }, \"eyes\": \"Blue/Green\", \"expression\": \"Varied (serious, smiling, laughing, focused)\" }, \"fashion\\_and\\_style\": { \"outfit\": { \"garment\": \"Strapless corset-style dress or top\", \"color\": \"Deep maroon / Berry\", \"fabric\": \"Satin or Silk\", \"details\": \"Ruched bodice, structural boning visible\" }, \"makeup\": { \"style\": \"Natural glam\", \"features\": \"Glowing skin, soft blush, defined lashes, nude/pink glossy lips\" } }, \"jewelry\\_focus\": { \"item\\_type\": \"Dangle Earrings\", \"metal\": \"Gold\", \"design\\_elements\": \\[ \"Huggie hoop base\", \"Large sunburst/starburst main charm\", \"Pave set crystals\", \"Delicate hanging chains\", \"Small star charms at ends of chains\" \\] }, \"setting\\_and\\_environment\": { \"location\": \"Luxury interior (likely a hotel suite or upscale bathroom)\", \"key\\_features\": \\[ \"Large rectangular mirror with integrated LED lighting border\", \"White marble countertops\", \"Wood paneling on walls\", \"Large floor-to-ceiling windows\", \"Beige curtains\" \\], \"lighting\": \"Mix of natural daylight and warm artificial vanity lighting\" }, \"props\\_and\\_objects\": { \"cosmetics\": \\[ \"Lip gloss tube\", \"Mascara/Eyeliner tube\", \"Glass perfume bottle with gold cap\", \"Round compact powder\" \\], \"tech\": \"Black smartphone\", \"background\\_props\": \"Beige silk/satin fabric cloth (in flat lay)\" }, \"panel\\_breakdown\": { \"top\\_row\": \\[ \"Reflection in lit mirror applying makeup\", \"Flat lay of jewelry and cosmetics on marble\", \"Close-up putting on earring near window\" \\], \"middle\\_row\": \\[ \"Extreme close-up of earring on ear\", \"Side profile focusing on hair texture and shoulder\", \"Waist-up portrait facing forward near window\" \\], \"bottom\\_row\": \\[ \"Portrait touching hair looking away\", \"Reflection in mirror laughing/smiling\", \"Flat lay of earrings on folded beige silk cloth\" \\] } }\n\nTry it now\n\nPromptOriginal\n\nBY[@はろ | AI活用とHALO式スライド](https://x.com/haro_marketing \"@はろ | AI活用とHALO式スライド\")\n\n2 days ago\n\n[\n\n### Ballpoint Pen Drawing of Umaibo Comparison\n\n](https://x.com/haro_marketing/status/2002869182917124238)\n\n![Ballpoint Pen Drawing of Umaibo Comparison - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489555401_htpz7w_G8ue4NDbcAABPi1-300x164.jpg)\n\n![Ballpoint Pen Drawing of Umaibo Comparison - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489555187_5jvvtu_G8ue3sObsAA8eFK-300x450.jpg)\n\nThis tweet compares the output of Nano Banana Pro and GPT Image 1.5 using the same prompt to generate an image of the snack 'Umaibo' rendered in a ballpoint pen drawing style.\n\nPromptOriginal\n\nPlease generate an image of Umaibo drawn with a ballpoint pen.\n\nTry it now\n\nPromptOriginal\n\nBY[@Sienna](https://x.com/siennalovesai \"@Sienna\")\n\n2 days ago\n\n[\n\n### Gym Pose Portrait with Reference Image Adherence\n\n](https://x.com/siennalovesai/status/2002861078888272203)\n\n![Gym Pose Portrait with Reference Image Adherence](https://cms-assets.youmind.com/media/1766489504497_9qkfhz_G8uXiCBXsAAoSzJ-300x537.jpg)\n\nPREVIEW\n\nA structured JSON prompt for generating a medium-full shot portrait of a fit woman posing in a gym, specifically looking back over her shoulder. Crucially, the prompt includes explicit instructions for strict adherence to an uploaded reference image for facial features and body proportions.\n\nPrompt\n\n{ \"image\\_generation\\_request\": { \"parameters\": { \"aspect\\_ratio\": \"9:16\", \"model\\_version\": \"v6.0\", \"stylize\": 250, \"quality\": \"high\" }, \"reference\\_settings\": { \"use\\_reference\\_image\": true, \"consistency\\_weight\": 1.0, \"instruction\": \"Strict adherence to uploaded reference image. Maintain exact facial features and body proportions with 0% deviation.\" }, \"prompt\\_structure\": { \"subject\": { \"demographics\": { \"gender\": \"Female\", \"physique\": \"Fit, toned\", \"hair\\_style\": \"Long straight black hair\" }, \"apparel\": { \"upper\\_body\": { \"item\": \"Tank top\", \"color\": \"Pink\", \"fit\": \"Athletic/Tight\" }, \"lower\\_body\": { \"item\": \"Athletic shorts\", \"color\": \"Gray\", \"texture\": \"Soft fabric\", \"fit\": \"Form-fitting/Highlighting physique\" } }, \"pose\\_and\\_expression\": { \"body\\_orientation\": \"Looking back over shoulder\", \"facial\\_expression\": \"Slight smile\", \"action\": \"Standing/Posing\" } }, \"environment\": { \"setting\\_type\": \"Indoor Gym\", \"architectural\\_details\": { \"wall\\_color\": \"White\", \"accents\": \"Blue\", \"flooring\": \"Standard gym flooring\" }, \"props\\_and\\_equipment\": \\[ \"Various exercise machines\", \"Gym equipment in background\" \\], \"lighting\": { \"source\": \"Overhead\", \"quality\": \"Artificial, bright\" } }, \"composition\": { \"camera\\_angle\": \"Eye level\", \"framing\": \"Medium-full shot\", \"focus\": \"Sharp focus on subject\" } } } }\n\nTry it now\n\nPromptOriginal\n\nBY[@セレナ](https://x.com/serena_ailab \"@セレナ\")\n\n2 days ago\n\n[\n\n### Nostalgic Japanese Flip Phone (Garakei) Display Generator\n\n](https://x.com/serena_ailab/status/2002854097494687964)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 1](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489550601_gq9cgn_G8uNwLBakAA1I5a-300x537.jpg)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 2](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489551094_rsidua_G8uNwLEa4AARSjR-300x537.jpg)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 3](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489552510_mt7jit_G8uNwK8a0AAApyl-300x537.jpg)\n\n![Nostalgic Japanese Flip Phone (Garakei) Display Generator - 4](/cdn-cgi/image/width=3840,quality=95,format=auto,metadata=none/https%3A%2F%2Fcms-assets.youmind.com%2Fmedia%2F1766489551136_8bniot_G8uNwLEaMAAXX9v-300x300.jpg)\n\nThis prompt uses Nano Banana Pro to embed an uploaded image onto the small LCD screen of an early 2000s Japanese flip phone (garakei). The scene is styled with nostalgic elements like pixelated edges, pastel beaded straps, photo stickers, and gel pens, evoking a 'kawaii' and emotional retro aesthetic.\n\nPrompt\n\nDisplay the subject from the attached image on a flip phone (garakei) LCD screen from early 2000s Japan. The phone is open, with glossy pink or white shell, physical buttons, and simple beaded straps with pastel colored beads. The screen shows the image with pixelated edges and warm color saturation typical of 2000s mobile displays. Surrounded by nostalgic items like photo stickers, gel pens, and mini notebooks. Nostalgic, kawaii, emotional, soft lighting.\n\nTry it now\n\nPromptOriginal\n\nBY[@Sienna](https://x.com/siennalovesai \"@Sienna\")\n\n2 days ago\n\n[\n\n### Baby Blue Polka Dot Top Bathroom Selfie Prompt\n\n](https://x.com/siennalovesai/status/2002845777840706047)\n\n![Baby Blue Polka Dot Top Bathroom Selfie Prompt](https://cms-assets.youmind.com/media/1766489561160_i6m9fm_G8uJnTPXsAAffsp-300x372.jpg)\n\nPREVIEW\n\nA prompt for generating a glamorous, flirtatious fashion snapshot. The subject has platinum blonde hair in a sleek high ponytail, wearing a baby blue polka-dot strapless top and low-rise white jeans, posing in a luxurious marble bathroom with a teasing gaze.\n\nPrompt\n\n{ \"aspect\\_ratio\": \"4:5\", \"scene\\_type\": \"indoor fashion snapshot\", \"environment\": { \"location\": \"luxurious bathroom\", \"background\": { \"wall\": \"marble wall\", \"mirror\": \"large mirror edge visible\" } }, \"subject\": { \"hair\": { \"color\": \"platinum blonde\", \"length\": \"long\", \"style\": \"high sleek ponytail\" }, \"wardrobe\": { \"top\": { \"item\": \"strapless fitted top\", \"color\": \"{argument name=\\\\\"top color\\\\\" default=\\\\\"baby blue\\\\\"}\", \"pattern\": \"small black polka dots\" }, \"bottom\": { \"item\": \"low-rise white denim jeans\" } }, \"accessories\": { \"bag\": { \"type\": \"small silver shoulder bag\" }, \"nails\": { \"color\": \"soft blue\" } }, \"pose\": { \"hand near mouth, direct teasing gaze\" } }, \"mood\": { \"vibe\": \"confident, glamorous, flirtatious\" } }\n\nTry it now\n\nLoading more...\n\n## Common Questions\n\nWhat is Nano Banana Pro?\n\nNano Banana Pro is Google's latest multimodal AI model featuring multimodal understanding (text, images, and video), high-quality generation from photorealistic to artistic styles, fast iteration with quick edits and variations, diverse styles from pixel art to oil paintings, precise control over composition and lighting, and complex multi-object, multi-character scene rendering.\n\nWhere do these prompts come from?\n\nThey are curated mainly from public Twitter/𝕏 sources. If you are the author and wish to opt out, please contact us for immediate removal.\n\nHow do I use these prompts?\n\nSimply copy the prompt and use it in YouMind with the 'Nano Banana Pro' image generation model according to the description. We are working on a tighter integration for one-click usage in the future.\n\nWhat is AI Shortcut?\n\nIt helps you consolidate your content creation and learning best practices into YouMind Shortcuts. This enables one-click generation based on your materials—like turning a YouTube video into a blog post or extracting quotes from an article.\n\nAre there more use cases?\n\nCheck out our blog post [Nano Banana Pro Hands-On: 10 Mind-Blowing Real-World Cases](https://youmind.com/blog/nano-banana-pro-10-real-cases) for more curated Nano Banana Pro examples.\n\n## Ready to create with  \nNano Banana?\n\nExperience Nano Banana Pro's Powerful Capabilities  \nLET YOUR IMAGINATION SOAR\n\n[Start Generating](https://youmind.com/boards)\n\nEnglish\n\n简体中文\n\n繁體中文\n\n日本語\n\n한국어\n\nไทย\n\nTiếng Việt\n\nहिन्दी\n\nespañol (España)\n\nespañol (Latinoamérica)\n\nDeutsch\n\nfrançais (France)\n\nitaliano\n\nportuguês (Brasil)\n\nportuguês (Portugal)\n\nTürkçe\n\nAuto\n\n1:1\n\n16:9\n\n9:16",
  "url": "https://youmind.com/nano-banana-pro-prompts"
}]